{
    "Title": [
        "Software Engineer I",
        "Front-End Web Developer",
        "Front-End Web Developer",
        "Junior Software Development Engineer",
        "Software Engineer, Enterprise",
        "Entry Level Software Engineer (Remote)",
        "Software Engineer (Front End)",
        "Software Engineer",
        "Software Engineer",
        "Frontend Software Engineer",
        "Frontend Software Engineer (Remote)",
        "Software Engineer - Junior(REMOTE)",
        "Internship - Software Engineer",
        "Software Engineer - Front End (React)/Kotlin",
        "Junior Software Engineer",
        "Software Engineer",
        "Junior Web Developer",
        "Frontend Software Engineer",
        "Junior Web Developer",
        "Junior Software Engineer",
        "Software Engineer - Jr.",
        "Associate Front End Software Engineer",
        "Software Engineer",
        "Software Engineer",
        "Software Engineer I",
        "Software Engineer (Jr to Sr Levels)",
        "Software Engineer (Remote) - Junior Level",
        "Junior Software Engineer",
        "Associate Front End Software Engineer",
        "Junior Full Stack Software Engineer",
        "Software Engineer (Jr to Sr Levels)",
        "Software Engineer",
        "Jr Web Developer (Entry Level)",
        "Software Dev Engineer I",
        "Junior Software Engineer",
        "Software Engineer 1",
        "Web Developer Intern",
        "Software Engineer",
        "Full Stack Web Developer",
        "Software Engineer - Full Stack/Front End",
        "Software Engineer",
        "Junior Software Engineer",
        "Software Engineer Intern",
        "Junior Software Engineer",
        "Software Engineer 1",
        "Intermediate Software Engineer (Full Stack) Remote!",
        "Full Stack Software Engineer",
        "Software Dev Engineer I",
        "Software Engineer",
        "Junior Full Stack Web Developer",
        "Software Dev Engineer I",
        "Software Engineer 0",
        "Software Engineer, FBM LE2, Early Career",
        "Software Engineer (L4), Consumer ML Model Compute & Serving Systems",
        "Junior Software Development Engineer",
        "Software Engineer",
        "Associate Front End Software Engineer",
        "Junior Software Engineer",
        "Fullstack Software engineer - Fintech/ Flexibility",
        "Software Engineer (Contract)"
    ],
    "Company": [
        "The Walt Disney Company",
        "PRIME",
        "PRIME",
        "Team Remotely Inc",
        "Notion",
        "Engtal",
        "Edmunds",
        "Microsoft",
        "Flip",
        "HeyGen",
        "HackerRank",
        "SynergisticIT",
        "Upper Hand",
        "Lowe's Companies, Inc.",
        "Pronto",
        "Lattice",
        "Team Remotely Inc",
        "Zicasso",
        "Dexian Inc",
        "Supernova Technology™",
        "Prodware Solutions",
        "Red Hat",
        "Caron Engineering, Inc.",
        "Mastercard",
        "Microsoft",
        "Nomic Bio",
        "SynergisticIT",
        "Patterned Learning Career",
        "Red Hat",
        "Ampcus Inc",
        "Nomic Bio",
        "Microsoft",
        "Planned Systems International",
        "Amazon",
        "Throtle",
        "Garmin",
        "Eulerity",
        "ServiceNow",
        "Team Remotely Inc",
        "Common Room",
        "Fay",
        "Outcomes®",
        "Usage AI",
        "First Advantage",
        "Garmin",
        "Super.com",
        "Zwift",
        "Amazon",
        "Lionsgate",
        "Patterned Learning Career",
        "Amazon",
        "Amches, Inc. now an InterImage Company",
        "Lockheed Martin",
        "Netflix",
        "Patterned Learning Career",
        "Lockheed Martin",
        "Red Hat",
        "Surfside",
        "Hopper",
        "Modern Animal"
    ],
    "Job Description": [
        "About The Role & TeamOn any given day at Disney Entertainment & ESPN Technology, we’re reimagining ways to create magical viewing experiences for the world’s most beloved stories while also transforming Disney’s media business for the future. Whether that’s evolving our streaming and digital products in new and immersive ways, powering worldwide advertising and distribution to maximize flexibility and efficiency, or delivering Disney’s unmatched entertainment and sports content, every day is a moment to make a difference to partners and to hundreds of millions of people around the world.The Identity Engineering organization is responsible for Recognizing, Knowing and Understanding consumers through login, registration and permission management functionality and interacts with all major business stakeholders within The Walt Disney Company.What You Will DoWe are looking for a hard-working Software Engineer I to join our highly collaborative team of full stack engineers. You will report directly to the software engineering manager and assist with all functions of software coding, testing, and design. You will have the opportunity to work on both UI and backend services, across our large suite of applications (starting with one or two specific focus areas).ResponsibilitiesLearning the focus area codebase and improving coding skills.Working as a full stack engineer on UI and backend servicesWriting and maintaining code and tests, perform manual testing and debug code.Participate in stand-ups and other agile sprint meetings.Implement innovative solutions and improve existing servicesCollaborate with other engineers to deliver new features and bug fixes.Required Qualifications & SkillsBasic foundation of programming knowledge in Java, Python, or other object-oriented programming languages.Experience with JavaScript/HTML/CSS.Ability to learn new software and technologies quickly.Ability to follow instructions and work in a collaborative team environment.Self- motivated and detail-oriented.Education Bachelor’s degree in Computer Science, Information Systems, Software, Electrical or Electronics Engineering, or comparable field of study, and/or equivalent work experienceThe hiring range for this position in Seattle, WA is $98,000 to $131,300 per year based on a 40 hour work week. The amount of hours scheduled per week may vary based on business needs. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.                                                                                 ",
        "Our Company{{:}} Congo Brands is at the epicenter of where consumer demand meets product development. Through brand partnerships with lead influencers, we are afforded an inside look at what consumers truly desire. E-commerce becomes the laboratory for consumer feedback and serves as a data pool for future retail endeavors. Congo Brands is a health and wellness brand that sells supplements, fitness snacks, hydration drinks, energy drinks, and more through ecommerce and retail partnerships. Congo Brands houses some of the World's most noted brands including Alani Nu, Prime Hydration, Prime Energy, and 3D Energy only to include more in the coming years. Congo Brands is on pace to become one of the World's most noted consumer product brand companies, with revenue growth increasing exponentially year over year. Congo Brand's goal is to be the go-to ‘Better for You Brand' for everything from nutritional supplements, energy drinks, snacks and much more.The Role{{:}} The Front-End Web Developer will have a strong focus on ecommerce platforms, such as SuiteCommerce, and Shopify, and utilize performance tools, accessibility audits, A/B testing and automated testing to ensure great customer experiences across all Congo Brands websites. The Front-End Web Developer will collaborate with cross-functional teams and external vendors, leveraging their skills and industry knowledge to drive user experience improvements, increase sales, and contribute to overall company growth. Key Responsibilities{{:}} Maintain and implement brand web standards for all online properties.  Build pixel-perfect responsive recreations of designs.  Work with different teams to enhance the UI/UX of their platforms.  Work closely with the Applications and Development Manager to deliver high-quality applications for internal and external systems.  Optimize performance and accessibility of existing online properties.  Assist with A/B testing of new UI/UX elements on various online properties.  Develop and maintain company websites on SuiteCommerce, Shopify, and other platforms.  Maintain and utilize version control in multiple codebases.  Create custom email templates for various marketing platforms.  Assist in gathering and refining technical specifications and requirements to ensure design solutions meet business needs.  Manage multiple high-priority projects and tasks under deadlines.  Gather required data from key stakeholders to evaluate goals, objectives, and scope.  Leverage a range of soft and technical skills to accomplish business objectives.  Stay current with emerging technologies and industry trends and apply them to improve company strategies and processes.  Work effectively with external vendors and third-party developers.  Perform other duties as assigned.   Key Skills and Experience Preferred{{:}} 2+ years in a UI/UX/Frontend role in an e-commerce environment.  2+ years working with project management tools, i.e. Azure DevOps, SmartSheets, or ClickUp.  2+ years working with a NetSuite SuiteCommerce framework.  2+ years working with a Shopify theme framework.  Knowledgeable about best web practices and web accessibility.  Has a strong grasp of optimizing the performance optimization of websites.  Proficient with CSS/JS/HTML/SASS/Node/Gulp.  Strong frontend QA skills.  Experience working with web 3d tools such as Three.js is a plus.  Proficient in Git version control. Comfortable with merges and conflict resolution to maintain code integrity and support collaborative development workflows.  Comfortable working with and adhering to established code standards.  Comfortable using design tools such as Figma, Sketch, Photoshop, or Illustrator.  Familiarity with automated testing frameworks.  A strong understanding of development and programming best practices across programming languages and developer environments.  The ability to meet deadlines while maintaining quality work standards, working independently and collaboratively.  Strong communication skills to convey complex technical concepts to non-technical stakeholders.  Attention to detail and a commitment to delivering high-quality work.  A strong interest in staying up to date with industry trends and emerging technologies, while learning pre-existing technologies that the company still relies on.  Benefits{{:}} Salary (exempt employment) Bonus - eligible based on individual and company performance Benefits - Health, Dental, Vision (eligible first of the month after start date) 401(k) - 4% maximum match (eligible the first enrolment period after sixth months of employment) PTO - 15 days plus paid holidays Monthly phone allowance Employee rewards program  #PRIME Congo Brands, LLC. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law.                                                                         ",
        "Our Company{{:}} Congo Brands is at the epicenter of where consumer demand meets product development. Through brand partnerships with lead influencers, we are afforded an inside look at what consumers truly desire. E-commerce becomes the laboratory for consumer feedback and serves as a data pool for future retail endeavors. Congo Brands is a health and wellness brand that sells supplements, fitness snacks, hydration drinks, energy drinks, and more through ecommerce and retail partnerships. Congo Brands houses some of the World's most noted brands including Alani Nu, Prime Hydration, Prime Energy, and 3D Energy only to include more in the coming years. Congo Brands is on pace to become one of the World's most noted consumer product brand companies, with revenue growth increasing exponentially year over year. Congo Brand's goal is to be the go-to ‘Better for You Brand' for everything from nutritional supplements, energy drinks, snacks and much more.The Role{{:}} The Front-End Web Developer will have a strong focus on ecommerce platforms, such as SuiteCommerce, and Shopify, and utilize performance tools, accessibility audits, A/B testing and automated testing to ensure great customer experiences across all Congo Brands websites. The Front-End Web Developer will collaborate with cross-functional teams and external vendors, leveraging their skills and industry knowledge to drive user experience improvements, increase sales, and contribute to overall company growth. Key Responsibilities{{:}} Maintain and implement brand web standards for all online properties.  Build pixel-perfect responsive recreations of designs.  Work with different teams to enhance the UI/UX of their platforms.  Work closely with the Applications and Development Manager to deliver high-quality applications for internal and external systems.  Optimize performance and accessibility of existing online properties.  Assist with A/B testing of new UI/UX elements on various online properties.  Develop and maintain company websites on SuiteCommerce, Shopify, and other platforms.  Maintain and utilize version control in multiple codebases.  Create custom email templates for various marketing platforms.  Assist in gathering and refining technical specifications and requirements to ensure design solutions meet business needs.  Manage multiple high-priority projects and tasks under deadlines.  Gather required data from key stakeholders to evaluate goals, objectives, and scope.  Leverage a range of soft and technical skills to accomplish business objectives.  Stay current with emerging technologies and industry trends and apply them to improve company strategies and processes.  Work effectively with external vendors and third-party developers.  Perform other duties as assigned.   Key Skills and Experience Preferred{{:}} 2+ years in a UI/UX/Frontend role in an e-commerce environment.  2+ years working with project management tools, i.e. Azure DevOps, SmartSheets, or ClickUp.  2+ years working with a NetSuite SuiteCommerce framework.  2+ years working with a Shopify theme framework.  Knowledgeable about best web practices and web accessibility.  Has a strong grasp of optimizing the performance optimization of websites.  Proficient with CSS/JS/HTML/SASS/Node/Gulp.  Strong frontend QA skills.  Experience working with web 3d tools such as Three.js is a plus.  Proficient in Git version control. Comfortable with merges and conflict resolution to maintain code integrity and support collaborative development workflows.  Comfortable working with and adhering to established code standards.  Comfortable using design tools such as Figma, Sketch, Photoshop, or Illustrator.  Familiarity with automated testing frameworks.  A strong understanding of development and programming best practices across programming languages and developer environments.  The ability to meet deadlines while maintaining quality work standards, working independently and collaboratively.  Strong communication skills to convey complex technical concepts to non-technical stakeholders.  Attention to detail and a commitment to delivering high-quality work.  A strong interest in staying up to date with industry trends and emerging technologies, while learning pre-existing technologies that the company still relies on.  Benefits{{:}} Salary (exempt employment) Bonus - eligible based on individual and company performance Benefits - Health, Dental, Vision (eligible first of the month after start date) 401(k) - 4% maximum match (eligible the first enrolment period after sixth months of employment) PTO - 15 days plus paid holidays Monthly phone allowance Employee rewards program  #PRIME Congo Brands, LLC. is an Equal Opportunity Employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status, age, or any other classification protected by Federal, state, or local law.                                                                         ",
        "This is a remote position. Junior Software Development Engineer (1 year experience, remote)Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process. Hiring Type: Full-Time Base Salary: $57K-$67K Per Annum.Description:As a Junior Software Development Engineer, you will play a crucial role in the design, development, and maintenance of our software applications. You will work closely with senior engineers and collaborate with cross-functional teams to deliver high-quality solutions. This is an exciting opportunity to kick-start your career in software development and contribute to innovative projects in a supportive and collaborative environment.Responsibilities:Collaborate with the development team to understand project requirements and objectives Participate in the entire software development lifecycle, from design to deployment Write clean, efficient, and maintainable code following best practices and coding standards Contribute to the development of both front-end and back-end components Collaborate with designers to ensure a visually appealing and user-friendly interface Integrate APIs and web services to enable seamless communication between different systems Conduct testing and debugging to ensure the functionality and performance of applications Participate in code reviews and provide constructive feedback to improve code quality Stay up-to-date with the latest software development trends and technologies Document technical specifications and project details Qualifications:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience) Solid understanding of software development principles and best practices Proficiency in at least one programming language (e.g., Java, C++, Python, Ruby) Familiarity with front-end development languages such as HTML, CSS, and JavaScript Knowledge of relational databases and SQL Understanding of version control systems (e.g., Git) Strong problem-solving and analytical skills Excellent communication and collaboration abilities Ability to work independently and within a team Eagerness to learn and adapt to new technologies Preferred Qualifications:Experience with software development projects (personal or professional) Familiarity with front-end frameworks/libraries like React, Angular, or Vue.js Knowledge of back-end frameworks (e.g., Spring, Django, Ruby on Rails) Exposure to cloud platforms such as AWS, Azure, or Google Cloud Understanding of Agile development methodologies Basic understanding of software testing principles and methodologies Benefits:Flexible vacation, unlimited paid holidays, and paid sick days 401(k) with up to 2% employer match Health, vision, and dental insurance                                                                         ",
        "About UsWe're on a mission to make it possible for every person, team, and company to be able to tailor their software to solve any problem and take on any challenge. Computers may be our most powerful tools, but most of us can't build or modify the software we use on them every day. At Notion, we want to change this with focus, design, and craft.We've been working on this together since 2016, and have customers like Pixar, Mitsubishi, Figma, Plaid, Match Group, and thousands more on this journey with us. Today, we're growing fast and excited for new teammates to join us who are the best at what they do. We're passionate about building a company as diverse and creative as the millions of people Notion reaches worldwide.Notion is an in person company, and currently requires its employees to come to the office for two Anchor Days (Mondays & Thursdays).About The RoleRemember the first time you solved a problem by programming? The delight and excitement you felt when it finally...worked? We want to deliver that experience to everyone by giving them the building blocks to create useful tools of all kinds—without needing to code. That's been the vision of computing pioneers since the 70s. Today, all the infrastructure is present, but we need your engineering to pull it off. We're looking to bring someone on with 8+ years of experience.What You'll DoYou'll work with others to build new product features from start to finish: through conception, research, implementation, and maintenance. For example, you might build a tool that allows admins to manage all their workspaces at once. You'll help improve performance and reliability, or polish existing features. For example, you might optimize our block data model.You'll build internal tools to support simplicity and productivity for the whole team. This might include building dashboards and alerting to ensure that our features are reliable.What We're Looking ForThoughtful problem-solving: For you, problem-solving starts with a clear and accurate understanding of the context. You can decompose tricky problems and work towards a clean solution, by yourself or with teammates. You're comfortable asking for help when you get stuck.Shipping quality user interfaces: You can work with others to build and maintain quality user interfaces for a big audience, using Web technologies like HTML, CSS, TypeScript, and a modern UI framework like React. If you've experienced the technical challenges of rapid growth, that's a plus.Familiarity with the backend: You understand how parts of a system fit together—from the user interface to the data model. Experienced candidates should be familiar with relational database systems like Postgres or MySQL.Pragmatic and business-oriented: You care about the business impact of what you're building, and you prioritize projects accordingly. You're not just going after cool stuff—you understand the balance between craft, speed, and the bottom line.Put users first: You think critically about the implications of what you're building, and how it shapes real people's lives. You understand that reach comes with responsibility for our impact—good and bad.Not ideological about technology: To you, technologies and programming languages are about tradeoffs. You may be opinionated, but you're not ideological and can learn new technologies as you go.Empathetic communication: You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time. In disagreements, you engage thoughtfully with other perspectives and compromise when needed.Team player: You understand when work is better, together. You enjoy collaborating cross-functionally to accomplish shared goals, and you care about learning, growing, and helping others to do the same.Bonus PointsYou're proficient with any part of our technology stack: React, TypeScript, Node.js, and Postgres.You have prior experience working on Enterprise systems: SAML, SCIM, eDiscovery, Access control mechanisms like RBAC, and more.You've heard of computing pioneers like Ada Lovelace, Douglas Engelbart, Alan Kay, and others—and understand why we're big fans of their work.You have interests outside of technology, such as in art, history, or social sciences.We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco, the estimated base salary range for this role is $160,000 - $250,000 per year.                                                                         ",
        "Please note: If you're interested in this position, please only apply via LinkedIn and do not reach out to our team directly as this can slow down our hiring process.We are seeking a highly motivated and technically skilled Entry-Level Software Engineer to join our dynamic team. As a Software Engineer, you will be involved in the design, development, testing, and maintenance of software applications. This is an exciting opportunity for a recent graduate or an individual with foundational programming skills to grow within a collaborative and innovative work environment.Key Responsibilities:Collaborate with cross-functional teams to understand project requirements and specifications.Assist in the design and development of software solutions under the guidance of senior engineers.Write clean, efficient, and well-documented code.Participate in code reviews to ensure code quality and adherence to coding standards.Debug and troubleshoot software issues, providing timely resolutions.Contribute to the testing process, including unit testing and participation in system testing.Stay updated on emerging technologies and industry best practices to enhance personal and team proficiency.Work closely with senior engineers to enhance your technical skills and understanding of software development methodologies.Communicate effectively with team members to share insights, ideas, and progress updates.Qualifications:Bachelors degree in Computer Science, Software Engineering, or a related field.Strong understanding of programming languages such as Java, Python, C++, or similar.Familiarity with software development tools and version control systems.Knowledge of basic software development principles and practices.Eagerness to learn and adapt to new technologies and methodologies.Strong problem-solving and analytical skills.Excellent communication and collaboration skills.Internship experience or personal projects showcasing programming skills is a plus.Ability to work in a fast-paced and collaborative team environment.                                                                         ",
        "Edmunds offers flexibility to work fully remote, from our Edquarters, or a combination of bothAt Edmunds we’re driven to make car buying easier. Ever since we began publishing printed car guides in the 60’s, the company has been in the business of trust, innovating ways to empower and support car shoppers. When Edmunds launched the car industry’s first Internet site in 1994, we established a leadership position online and have never looked back. Now, as one of the most trusted review sites on the Internet, millions of visitors use our research, shopping and buying tools every month to make an easy and informed decision on their next car. For consumers, we bring peace of mind. For dealers, we make tools to help them solve their problems and sell more cars. How do we do it, you ask? The key ingredients are our enthusiastic employees, progressive company culture and cutting-edge technology. Want to join the team? Read on to find out how!What You’re Applying ForAs a Full Stack Software Engineer, you'll play a pivotal role in crafting and implementing cutting-edge solutions aimed at enhancing the car shopping experience for users. Your responsibilities will include designing and developing intuitive, feature-rich applications that empower car shoppers throughout their research and purchasing journey. You'll collaborate closely with cross-functional teams to translate user needs into innovative software solutions, leveraging your expertise in front-end development to deliver seamless and impactful user experiences.What You’ll DoHelp customers complete more of the automotive transaction online by building deeper integrations with forward-looking dealers. Assure shoppers that they are getting a good deal by revamping the way we present pricing on our websiteStreamline the way customers reach out to dealers through our platform by optimizing the performance of those pagesResearch and evangelize modern Javascript best practices and client-side application designCoordinate the development of front-end features from technical design to production deploymentCollaborate with product managers, designers, and other software engineersWhat You NeedDemonstrated ability to see projects to completion both independently and working in close collaboration with others in a team environment.Experience in building, unit testing, documenting, and refactoring client-side applicationsFamiliarity with testing strategies, cross-browser compatibility, and clientside performance optimisationExperience with React and isomorphic Javascript to design and develop immersive user experiences. Node.js experience is a plusExperience Implementing responsive designs with CSS and ensure optimal page performance as defined by internal and industry-standard metrics including Google Core Web VitalsAbility to collaborate closely with cross-functional teams, you'll leverage your proficiency in both front-end and back-end development to create seamless solutions that empower car shoppers throughout their research and purchasing journeyExperience working with Backend services in leveraging in-house/3rd Party APIs using REST and/or GraphQLExperience with a cloud platform such as AWS, GCP, or Azure is a plus (AWS is preferred)Experience building email templates with Marketo a plusWhy would you want this job?You love building intuitive and elegant user interfacesYou want to make a real impact on the way people buy carsYou appreciate working with talented individuals in a variety of roles including software engineering, product management, and design The compensation range for this position is $109,900 - $191,800 per year. The base pay will take into account internal equity as well as job-related knowledge, skills, and experience among other factors. In addition, Edmunds offers full-time employees a comprehensive total rewards package including the benefits listed below.Edmunds PerksFlexible time off13 Paid HolidaysComprehensive Health Benefits (medical, dental, vision, life and disability)Flexible Spending Accounts (Employees) and Health Savings Accounts (Employee and Employer Contributions)401K Plan with company matching at 100%, up to 6% of eligible salary with immediate vestingStock purchase programCarMax vehicle discountUp to 4 months Paid Parental LeaveHeartCash matches employee donations to the causes that are important to them2 Days of Paid Time Off for time to dedicate to social impact causesFitCash covers a portion of gym or fitness activity feesWell being sessions and events such as yoga, meditation and walking challengesOn-going career development sessions and an annual learning eventPet insuranceSabbatical leaveEducation ReimbursementPre-tax spending accounts for qualified transportation expensesPlus a coffee bar, frozen yogurt and more!Working @ Edmunds.com:Employees think it’s a pretty great place to work and some pretty impressive publications think it is too: we have been recognized as one of the best places to work by the Fortune Magazine and Great Places to Work, LA Business Journal (for the last 6 years!), Computerworld, Built in LA and Inc. Magazine. We've also been identified as one of the best workplaces specifically in Technology and also for Diversity and Asian Americans. If you’re interested in learning more and joining our mission, we’d love to hear from you!Edmunds will consider for employment qualified candidates with criminal histories in a manner consistent with the requirements of all applicable laws.#BI-Remote                                                                         ",
        "Azure Storage team is chartered with building, managing, and running the persistent cloud storage for Microsoft Azure cloud. We are one of the foundational services in the Azure Cloud and host data from some of the largest companies in the world plus all of Microsoft’s largest online businesses.We are looking for a Software Engineer who is passionate about building and optimizing a world class distributed file system. If you love large scale distributed systems, love to work on new projects where you can define the work, scope, direction, and architect new solutions to make an impact on a massive product like Azure Storage, this could be position for you! You will have an opportunity to make high impact changes on a daily basis as you build a hyperscale storage system that may indirectly or directly be used daily by of your friends and family.You would be joining a talented, highly collaborative team, with responsibility for engineering the lowest most fundamental layers of the Azure storage service. You will be working on the next generation storage platform being built on storage servers with Data Processing Units (DPU). The role brings exposure to cutting edge storage, memory, networking, and distributed system technologies, with broad opportunity to influence both the business and the industry. The team is responsible for the meta-data data service as well as storing the data across storage servers while ensuring high availability, reliability, durability, and cost efficiencies.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.Relocation assistance is unavailable for this role.ResponsibilitiesWorks with appropriate stakeholders to determine user requirements for a set of features.Contributes to the design, and creates and implements code for a product, service, or feature, reusing code as applicable.Contributes to efforts to break down larger work items into smaller work items and provides estimation.Acts as a Designated Responsible Individual (DRI) working on-call to monitor system/product feature/service for degradation, downtime, or interruptions and gains approval to restore system/product/service for simple problems.Contributes to improving availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.QualificationsRequired Qualifications: Bachelor's degree in Computer Science or related technical field AND experience with coding in languages, C, C++ or JavaOR equivalent experience.Experience in data structures and algorithms, with problem solving, debugging and analytical skills.Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud Background Check upon hire/transfer and every two years thereafter. Preferred QualificationsBachelor's Degree in Computer Science or related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++ or JavaOR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++ or JavaOR equivalent experience.Experience in building and operating services at scale.Experience in Storage or File-Systems, Networking, Distributed Systems, Operating Systems and/or Applications at scale is preferred but not required.Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-payMicrosoft will accept applications and processes offers for these roles on an ongoing basis.#azurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.                                                                                 ",
        "Who The Flip Is Flip?Ever have a bad experience calling customer service? We're changing that!Flip replaces old customer service phone robots with a modern \"Alexa\"-like voice AI experience for 200+ of the best companies on the planet in eCommerce and Transportation (more verticals coming soon!). We talk to millions of people every week, and have helped 200M+ callers so far.FYI: those \"tech layoffs\" you see in the news aren't happening here! Flip is a profitable, fast-growing 25-person startup, and we're raising a Series A in 2024 to follow up on our $7.5M Seed.What You’ll DoWe are looking for a few great product engineers (backend software engineers that love building products) to join us in creating the next generation of our over-the-phone voice assistant.At Flip, you'll create user experiences, features, and oversee whole segments of the Flip assistant. You'll also get into the data, listen to our customers, and help shape the direction of the product. We have a few excellent senior engineers already on the team, one of which will become your direct mentor!Who You Are, As An EngineerGood on the backend, with (at least a bit of) Python experience - we're almost all backend here, because voice products have no GUI!Your engineering level: early mid-level up to 'nearing senior in a year or two'The product is what we're working on - not theoretical engineering perfection! :)You care about the customerWho You Are, As A PersonLooking to go all-in, learn a lot, and do the best work of your career (so far!)Put in the time, and put out work you're proud ofCommunicate well, and embrace ownership, speed, & occasional uncertaintyEager and willing to support your teammates - just like they will with you!BonusesKnow what it looks like to work at a startup, and have an entrepreneurial driveExperience building Voice products - but we can teach you this too :)Proximity to NYC, SF, or LA - we have a few offices, but also people fully remote!More About UsWe're international, spanning the US, UK, and CanadaOur tech stack includes Python, MongoDB, AWS, Twilio, Datadog, Snowflake, and LookerWe are backed by ScOp Venture Capital, Bullpen Capital, and Forum Ventures, as well as founders & executives from Amazon Alexa, Ada, Attentive, and SimonComprehensive healthcare and unlimited vacation, including a mandatory half week for everyone over July 4, and a full week off at the end of the year                                                                         ",
        "The mission at HeyGen is to make visual storytelling accessible to all. HeyGen is the fastest-growing generative AI platform for anyone who wants to create videos for their business. Come join our team in revolutionizing the way videos are created.Learn more at www.heygen.comHeyGen, a trailblazing AI-powered platform transforming the landscape of video creation, is seeking a talented Frontend Engineer to join our dynamic team. As a Frontend Engineer at HeyGen, you will play a crucial role in shaping the future of our cutting-edge platform, focusing primarily on the development and enhancement of its user-facing components.Key Responsibilities:Frontend Development: Design, implement, and maintain high-quality frontend features for the HeyGen platform. Ensure optimal performance, scalability, and responsiveness of the user interface.Collaboration: Work closely with UX/UI designers to translate designs and wireframes into high-quality code. Collaborate with backend engineers and product managers to ensure seamless integration of frontend and backend components.User Experience Focus: Prioritize user experience in all development efforts. Conduct user testing and feedback sessions to refine and improve the platform interface.Maintenance & Optimization: Monitor the frontend performance, identify and resolve issues. Stay updated with emerging frontend technologies and best practices to continually enhance the platform's user interface.Qualifications:Proficiency in frontend technologies such as React, JavaScript, CSS, and HTML.Experience with responsive and adaptive design principles.Familiarity with RESTful API integration.Understanding of version control systems like Git.Excellent problem-solving skills and attention to detail.Prior experience in SaaS and AI product development is a plus.What HeyGen Offers:Competitive salary and benefits package.Dynamic and inclusive work environment focused on innovation and creativity.Opportunities for professional growth and skill development.Collaborative culture that values teamwork and employee input.Access to state-of-the-art technologies and tools.HeyGen is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.Join us at HeyGen and be part of a team that's reshaping the world of video creation through innovative technology!                                                                                 ",
        "At HackerRank, we help over 2,500 of the most prestigious logos across industries find, hire, and upskill amazing developer talent using our SaaS-based Developer Skills Platform. We pioneered and continue to lead the developer skills market with the ethos of “Skills over Pedigree”. Everyone at HackerRank is passionate about the mission, and we are looking to add smiling faces to help us “Accelerate the World’s Innovation” by making skills matter more the pedigree. This position is full-time and Remote within the United States.As a Frontend Engineer, you will be pivotal in HackerRank’s mission to “Accelerate the World’s Innovation”. You are excited to impact the lives of millions of developers as you build the platform for them to showcase their skills and get hired. We’re responsible for creating the world’s leading technical interview platform. We believe in “Extreme ownership,” and you’ll have immense ownership of products and engineering.Your work will directly impact the lives of millions of developers as you build the platform for them to showcase their skills and get hired. You will be responsible for building systems that back the screen, interviews, and other product lines and building the best developer experience for each of our products. You’d be working on helping us scale our products to handle over 100K concurrent users to support significant country-wide remote hiring events. As part of this, you must also build a platform to provide world-class developer experience (Coding editor, Autocomplete, Linting, Ability to run code quickly, etc.) on the cloud at scale. Along with all of this, you will also be responsible for mentoring interns and delivering essential product and tech initiatives.You Will Be Working OnPartnering with product designers and product managers to build and improve workflows and user experience for various personas like Interviewer, Candidate, Recruiter, and Hiring ManagerBuilding uniform software front-end components that are pluggable and can be used across the organizations for various offerings.Understanding key web performance metrics for the product and striving to improve it on a regular basis.Actively participate in setting up good standards and conventions for front-end engineering and also review code for quality. We believe a good code is like good karma; it goes a long way.Collaborating with the engineers across the team for organization-wide initiatives, with the mission to improve software quality and user experience on a regular basisMentoring budding Engineers and InternsWe Are Looking ForStrong, self-motivated individuals looking to learn and contribute to key product and tech initiatives.Overall 2+ years of expertise in JavaScript-based UI Frameworks, with a strong preference for ReactJSWe also expect you to be good with fundamental Javascript, someone who is willing to admit I don’t know Javascript - https://github.com/getify/You-Dont-Know-JSGood hands-on practical knowledge of HTML and CSSExperience with frontend toolings like Webpack, babel, etcHands-on experience in frontend debugging and testingKeen attention to quality, someone who has set or used good coding standards for front-end developmentGood knowledge of various browser environments, compatibility, and any experience in building a multiscreen app is a bonusEye for detail and metrics-driven, especially around Web Performance and OptimizationNice To HaveFullstack experience is a plusUnderstanding of frontend securityExposure to other frontend frameworks besides ReactJSUnderstanding of backend APIs and technologiesExposure to typescript is a plusBenefits & PerksWe have a full package of competitive benefits and perks which include:One-time home office set up stipendMonthly Remote Work Enablement StipendProfessional Development ReimbursementWellbeing Benefits (Headspace, Cleo, etc)Unlimited paid time off, paid leave for new parents, and flexible work hoursInsurance for all employees (term life, personal accident, medical) along with medical insurance for their dependentsEmployee stock options, flexible work hours, and time offAbout HackerRankHackerRank is a Y Combinator alumnus backed by tier-one Silicon Valley VCs with total funding of over $100 million. The HackerRank Developer Skills Platform is the standard for assessing developer skills for 2,500+ companies across industries and 24M+ developers around the world. Companies like LinkedIn, Stripe, and Peloton rely on HackerRank to objectively evaluate skills against millions of developers at every step of the hiring process, allowing teams to hire the best and reduce engineering time. Developers rely on HackerRank to turn their skills into great jobs. We’re data-driven givers who take full ownership of our work and love delighting our customers!HackerRank is a proud equal employment opportunity and affirmative action employer. We provide equal opportunity to everyone for employment on the basis of individual performance and qualification. We never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines.We offer a comprehensive total rewards package where you’ll be rewarded based on your performance and recognized for the value you bring to the business.Total compensation and benefits consist of salary, quarterly performance incentives, equity (stock options), medical, dental, vision, life insurance, travel insurance, monthly work-from-home stipend, learning and development reimbursements, flexible remote-first work culture, 401(K), flexible time off, generous parental leave and more. Under our flexible paid time off policy, you’ll decide how much time you need based on your circumstances.Current base salary range: $110,000 to $130,000. The exact salary may vary based on skills, experience, location, market ranges, and other compensation offered. The salary range does not include other compensation components, commission (for sales-related roles), bonuses, or benefits that you may be eligible for. Salary may be adjusted based on business needs.                                                                         ",
        "Since 2010 Synergisticit has helped Jobseekers differentiate themselves by providing candidates the requisite skills and experience to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a Job we make careers.All Positions are open for all visas and US citizensWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart lab s etc to name a few.We have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, Java Full stack developers, Python/Java developers, Data analysts/ Data Scientists, Machine Learning engineers for full time positions with clients.Who Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and looking to make their careers in the Tech Industry.We assist in filing for STEM extension and also for H1b and Green card filing to CandidatesIf you applied for a job and got emails from our Job Placement Program team please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team.please check the below links to see success outcomes of our candidates and our participation at different Tech industry events and how we are different from other organizations in helping Jobseekers secure Tech careers(url removed)We regularly interact with the Top Tech companies to give our candidates a competitive advantage-Please see us exhibiting at Oracle Cloud world /Oracle Java one (Las vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023(url removed)(url removed)For preparing for interviews please visit (url removed)We are looking for the right matching candidates for our clientsPlease apply via the job postingREQUIRED SKILLS For Java /Full Stack/Software ProgrammerBachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, ITHighly motivated, self-learner, and technically inquisitiveExperience in programming language Java and understanding of the software development life cycleProject work on the skillsKnowledge of Core Java , javascript , C++ or software programmingSpring boot, Microservices, Docker, Jenkins and REST API's experienceExcellent written and verbal communication skillsFor data Science/Machine learning PositionsRequired SkillsBachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, ITProject work on the technologies neededHighly motivated, self-learner, and technically inquisitiveExperience in programming language Java and understanding of the software development life cycleKnowledge of Statistics, SAS, Python, Computer Vision, data visualization toolsExcellent written and verbal communication skillsPreferred skills: NLP, Text mining, Tableau, PowerBI, SAS, TensorflowIf you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team who only connect with candidates who are matching client requirements.No phone calls please. Shortlisted candidates would be reached out. No third party or agency candidates or c2c candidates                                                                                 ",
        "What You'll DoCollaborate with our engineering team to develop and enhance features for our platform, using Ruby on Rails, React, JavaScript, and other technologies in our stack.Participate in code reviews, learn best practices in software development, and contribute to maintaining high code quality standards.Assist in identifying, troubleshooting, and resolving bugs and performance issues.Engage in agile development practices and become an integral part of our sprints and project planning activities.Work on real-world projects that will directly impact our users, gaining experience that will be beneficial for your future career in software engineering.Who You AreCurrently enrolled in, or a recent graduate of, a computer science, software engineering, or related degree program.Demonstrated knowledge or experience in programming, particularly with Ruby on Rails, React, and JavaScript. While proficiency is a plus, a willingness and eagerness to learn is equally valuable.Familiarity with version control systems such as Git.Strong problem-solving skills and an analytical mindset.Excellent communication and teamwork skills, with a genuine passion for technology and innovation.Interest in sports and the sports tech industry is a bonus, enabling you to bring fresh perspectives to our projects.What ElseThis is a paid internship, designed to fit around your academic commitments with flexible hours.Opportunity to work in a dynamic, fast-paced environment with a team of experienced professionals who are passionate about what they do.Receive mentorship and training that will help bridge the gap between academic learning and real-world application.End the internship with tangible software development experience, working on projects that impact users nationwide.Exposure to industry-standard tools, practices, and methodologies in software development.Ready to Apply?If you're ready to apply your academic learning in a real-world setting and are excited about making a mark in the sports tech industry, we want to hear from you! Apply now by submitting your resume, a brief cover letter highlighting your interest in this internship, and any relevant projects or GitHub links showcasing your programming skills.Join Upper Hand and be part of a team that's transforming the sports industry through cutting-edge technology and innovation. We're excited to help you grow your skills and launch your career in software engineering!                                                                                 ",
        "The Homepage MyRedVest group designs, builds, and maintains applications that allow our store, contact center and corporate associates to get their jobs done more efficiently and effectively. In this specific role, we are looking for an engineer to work with a variety of front end, including mobile, and backend technologies to join a growing team to create new applications as well as maintain and improve existing apps across our portfolio.We are seeking a skilled Front-End Developer to join our dynamic team. We are building a hybrid UI that uses React for the desktop, incorporates multiple Micro Frontends (MFE), and the same web view will be used in Android applications. If you are passionate about creating seamless user experiences across platforms and have the technical expertise to bring our vision to life, we would love to hear from you.What You’ll DoDevelop and maintain front-end applications using React. Implement and manage multiple micro frontends (MFEs) within a single application. Ensure the hybrid UI functions seamlessly across both desktop and Android platforms. Collaborate with back-end developers, designers, and other team members to create cohesive and high-performing applications. Optimize front-end performance and ensure cross-platform compatibility. Troubleshoot and debug issues, ensuring timely resolution and minimal impact on users. Stay updated with the latest industry trends and technologies to ensure our applications remain cutting-edge. Who You AreA software engineer already familiar with some of the front end (AND backend technologies) listedOR a software engineer, familiar with some of the front end listed AND you are eager and excited to learnDemonstrated the ability to deliver quality, well-documented codePerform peer reviews and provide technical guidance to your team as neededDemonstrate software solutions to business/product stakeholdersQualificationsProven experience with React and component-based architecture. Strong understanding of hybrid UI development and cross-platform compatibility. Experience with micro frontend architecture and integrating multiple MFEsProficiency in HTML, CSS, and JavaScript. Experience with RESTful APIs and asynchronous programming. Ability to optimize front-end performance and enhance application speed and efficiency. Strong problem-solving skills and the ability to collaborate effectively with cross-functional teams. Familiarity with Android development is a plus. Knowledge of CI/CD pipelines and deployment processes is a plus. Where You’ll BeLowe’s supports a 2-day work from Office concept where it is possible to work from Home the remaining days of the weekMost meetings are planned around the Eastern time zoneAssociates are encouraged to relocate to the Charlotte region to foster collaboration and facilitate improved testing and supportLowe’s is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law.Pay Range for CA, CO, HI, NJ, NY, WA: $75,300.00 - $143,100.00 annually Starting rate of pay may vary based on factors including, but not limited to, position offered, location, education, training, and/or experience. For information regarding our benefit programs and eligibility, please visit https://talent.lowes.com/us/en/benefits.                                                                                 ",
        "We are seeking a skilled and motivated Junior Software Engineer to join our dynamic team. This person sits at the intersection between hardware and software, working with engineers from both sides to create solutions.What You’ll Work On:Automating linux device bring-up and configurationWriting scripts for hardware testing and creating debug/diagnostic toolingCreating tooling to record and update device configuration, serial numbers, etcReworking and organizing our device databaseBuilding device tracking dashboards for status, location, etcYour work will directly contribute to our fleet of autonomous trucks and auxiliary hardwareThis role has opportunities for growthYou'll Achieve This By:Solving challenging systems problemsWriting scripts for setup, configuration, and testingCreating and managing large databasesAutomating hardware and provisioning testingWorking with the team to deploy solutions in a mission critical environmentBuilding and maintaining core software infrastructureCreating efficient processes for device provisioning and testingRequirements:Internship or similar software experience highly suggestedProgramming experience with pythonLinux environment and bash scripting experienceExperience with AWS is a plusExperience interfacing with hardware is a plusAble to create and debug software systems: build maintainable code with good diagnostics that scalesExcellent at handling ambiguous or undefined problemsExcellent communication and organizational skillsEffective collaboration with members of the teamAttention to detail and overall fastidiousness a huge plusOur Stack:This part of the stack is mostly bash and pythonCompensation and BenefitsThis is a full time position based in San Francisco, CA, with a salary range between $90,000 - $120,000. Actual compensation offered will depend on work experience, education, skill level, and/or other business and organizational needs. Please note that it is not typical for an individual to be hired at or near the top of the range. Pronto reserves the right to modify this compensation range at any time.In addition to your salary, as a full-time Pronto employee you are eligible for the following benefits: Medical, Dental, Vision, Disability, and Life Insurance 401k with matching contributions Equity Sick Time, Unlimited Vacation, and Paid Holidays Paid Parental Leave Pre-Tax Commuter Benefit Plan Team lunch in our SOMA office every Tuesday and ThursdayPronto is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.                                                                                 ",
        "This is Engineering at LatticeLattice’s Engineering team is continuously working to better both our product and our craft. We use a modern, cutting-edge tech stack and love experimenting with new technologies. We strive for maintainable, robust, and performant code. We’re highly collaborative and continuously iterative and work closely with designers and product managers. We prioritize not only great technical architecture, but also an amazing product experience.Lattice is enhancing its platform so that every organization can manage its people efficiently and strategically. The HRIS admin team is focused on building the core experience for HR administrators to leverage Lattice as an HRIS. The team’s vision is to empower HR administrators with unprecedented data configurability and highlight actionable insights for strategic decision-making.What You Will DoYou’ll be responsible for building software to help companies build cultures in which their employees thrive.You’ll partner with other engineers to build and own products across a modern tech stack. Our current stack includes Typescript, React, Relay Modern, GraphQL, Node.js, PostgreSQL, and AWS.You’ll drive forward the execution of complex projects, many of which require tight cross-functional collaboration with product managers and designers as well as cross-team collaboration between engineers.You will make contributions to our engineering practices, identifying and evangelizing improvements to improve our team output.You will create and update high-quality technical documentation based on feedback from relevant stakeholders.You will focus on improving our user experience and find creative ways to reduce user pain points.What You Will Bring To The TableYou are passionate about software development and have 2+ years of professional experience writing and maintaining production-level applications.You have production-level experience in TypeScript, React, GraphQL, Node.js, and are passionate about learning and using any new technologies that are required at the job.Prior experience within B2B SaaS is a plus, not a requirement.You are efficient in SQL and know how to model data and write performant queries in a relational database like PostgreSQL.You love to work on challenging projects that require coordination with multiple teams and multiple engineers.You are able to seek out the root cause when debugging software defects, and champion improvements that prevent future issues.You are always striving towards understanding the codebase inside and out.You have the ability to understand the nuances of product requirements and translate them into code.You take care to write code that your colleagues will also own, comprehend, and maintain.You are clear and concise in explaining your thought process and in enumerating the tradeoffs made in your work.The estimated annual cash salary for this role is $112,000 - $164,500. This position is also eligible for incentive stock options, subject to the terms of Lattice’s applicable plans.Benefits: The Company offers the following benefits for this position, subject to applicable eligibility requirements: Medical insurance; Dental insurance; Vision insurance; Life, AD&D, and Disability Insurance; Emergency Weather Support; Wellness Apps; Paid Parental Leave, Paid Time off inclusive of holidays and sick time; Commuter & Parking Accounts; Lunches in the Office; Workplace Amenities Stipend, Internet and Phone Stipend; One time WFH Office Set-Up Stipend; 401(k) retirement plan; Financial Planning; Learning & Development Budget; Sabbatical Program; and Invest in Your People FundNote on Pay Transparency:Lattice provides an estimate of the compensation for roles that may be hired as required by state regulations. Compensation may vary based on (a) location, as Lattice factors in specific location when benchmarking compensation for most roles; (b) individual candidate skills and qualifications; and (c) individual candidate experience.Additionally, Lattice leverages current market data to determine compensation, so posted compensation figures are subject to change as new market data becomes available. The salary, other compensation, and benefits information is accurate as of the date of this posting. Lattice reserves the right to modify this information at any time, subject to applicable law.About LatticeLattice is on a mission to build cultures where employees and their companies thrive. In an age where employees have more choices than ever before, businesses that put employees first are winning 🏅– and Lattice is building the tools to empower those people-centric companies.Lattice is a people success platform that offers performance reviews, employee engagement surveys, real-time feedback, weekly check-ins, goal setting, and career planning in a way that allows companies to focus on employee development, growth, and engagement – yielding stronger employee retention, performance, and impact to the bottom line 📈. Since launching in 2016, we have grown to over 5,000+ customers globally, including brands like Slack, Robinhood, and Gusto.Lattice is committed to equal treatment and opportunity in all aspects of recruitment, selection, and employment without regard to gender, race, religion, national origin, ethnicity, disability, gender identity/expression, sexual orientation, veteran or military status, or any other category protected under the law. Lattice is an equal opportunity employer; committed to a community of inclusion, and an environment free from discrimination, harassment, and retaliation.By clicking the \"Submit Application\" button below, you consent to Lattice processing your personal information for the purpose of assessing your candidacy for this position in accordance with Lattice's Job Applicant Privacy Policy.                                                                         ",
        "This is a remote position. Junior Web Developer (1 year experience, remote)Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process. Hiring Type: Full-Time Base Salary: $58K-$68K Per Annum.Description:You will work closely with our senior developers to design, develop, and maintain high-quality websites and web applications. This is an excellent opportunity to gain hands-on experience in a collaborative environment and contribute to exciting projects.Responsibilities:Collaborate with the development team to understand project requirements and design web solutions Write clean, efficient, and well-structured code using HTML, CSS, and JavaScript Assist in the development and implementation of responsive and user-friendly web interfaces Integrate front-end designs with back-end functionality using appropriate technologies Conduct thorough testing and debugging to ensure seamless functionality Assist in website maintenance, updates, and enhancements Stay up-to-date with industry trends and emerging web development technologies Collaborate with cross-functional teams to deliver projects on time and within scope Document technical specifications, project details, and development processes Qualifications:Bachelor's degree in Computer Science, Web Development, or a related field Solid understanding of web development principles and best practices Proficiency in HTML, CSS, and JavaScript Familiarity with front-end frameworks such as Bootstrap or Foundation Basic understanding of back-end development technologies (e.g., PHP, Python, or Ruby) Knowledge of version control systems (e.g., Git) Experience with responsive web design and mobile-first development Strong problem-solving and analytical skills Excellent communication and teamwork abilities Self-motivated with a strong desire to learn and grow as a developer Preferred Qualifications:Previous experience with web development projects (personal or professional) Knowledge of JavaScript frameworks/libraries (e.g., React, Angular, or Vue.js) Familiarity with content management systems (e.g., WordPress, Drupal, or Joomla) Understanding of SEO principles and best practices Experience with web accessibility standards and guidelines Knowledge of web security best practices                                                                         ",
        "Company OverviewZicasso is a leading luxury travel company connecting discerning travelers with the world's top travel specialists who design personalized, life-enriching trips. With unsurpassed local knowledge and reputable in-country connections, our destination experts curate unique, exclusive experiences tailored to travel interests, from culinary journeys to cultural heritage tours, romantic escapes, family-friendly adventures, and more.Our esteemed clientele includes a Pulitzer Prize winner, Olympic cyclists, C-level executives, Academy Award recipients, and anyone seeking unforgettable, custom trips. Zicasso was selected \"Best in Travel\" by TRAVEL+LEISURE magazine and is regularly featured in The New York Times, The Wall St. Journal, The Washington Post, BBC, MSNBC, CNN, Fodor's, Frommer's, and more. Our thousands of 5-star reviews are a testament to the unforgettable, life-enriching travel experiences we design for our travelers.Our entire team is fully remote and spans across five continents. And we're growing!We value a dynamic and progressive work environment that encourages innovative ideas and recognizes individuals who exhibit creativity, initiative, and hard work. We welcome applicants who are motivated by the opportunity to continuously learn and grow with us, and who are eager to contribute to our company culture. We are seeking individuals who thrive in a dynamic, high-performance work setting and are excited to contribute to the success of our team.For more information on our company, visit www.zicasso.com.The RoleZicasso is looking for a highly skilled Frontend Software Engineer to join our team. As a Frontend Software Engineer, you will play a key role in developing and maintaining the core infrastructure that powers Zicasso's innovative travel platform. You will have the opportunity to work with cutting-edge technologies and collaborate with a talented team of engineers. The role reports to the VP of Engineering.There is flexibility in your work hours but we expect that you will generally maximize your overlap with California, eg. until 4 pm Pacific Time Zone.Key Responsibilities:Write bug-free code in HTML, CSS, Sass, Javascript, TypeScript, Angular and/or ReactEvaluate, suggest, and outline improvements to existing interface flowsBuild and maintain scalable web applications using custom, reusable, and responsive UI componentsWrite unit and integration tests, ensuring quality as we goUse modern debugging tools to set watch-points, break-points, and step the code. Tweak web applications to make them extremely fast (Google PageSpeed Insights)Evaluate innovative technologies, libraries, frameworks, architectural patterns, etcCollaborate with team members using GitHub, Atlassian(JIRA), Figma, etcWork closely with the product team and business to define, and implement featuresAttend agile team meetings, provide work estimates, participate in code reviews, pair coding, prepare demos, provide technical documentationRequired Skills and Experience:Bachelor's degree in Computer Science or related field5 to 8 years of experience in frontend software development, ideally in multiple languagesExperience in Programming and Object-Oriented Programming (OOP) conceptsExpertise in React, JavaScript, HTML, and CSSExperience working with source control systems such as GitExperience in working with API's and integrating with Back-End ServicesAbility to write clean, maintainable, and efficient codeExcellent problem-solving and debugging skillsStrong communication and collaboration skillsAbility to work independently and in a team environmentExperience in Agile development methodologies is considered a plusPassion for the travel industry and desire to create exceptional user experiencesWhat We Offer:Remote work and flexible hours that allow you to enjoy a great work-life balanceInnovative, fast-paced and collaborative culture that values diverse voices and opinionsLearning and development annual stipendAn unforgettable annual company retreat at one of the many international destinations we serve                                                                         ",
        "This is a remote position.Junior Web Developer (1 year experience, remote)Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.Hiring Type: Full-TimeBase Salary: $56K-$66K Per Annum.Description:You will work closely with our senior developers to design, develop, and maintain high-quality websites and web applications. This is an excellent opportunity to gain hands-on experience in a collaborative environment and contribute to exciting projects.Responsibilities:Collaborate with the development team to understand project requirements and design web solutions Write clean, efficient, and well-structured code using HTML, CSS, and JavaScript Assist in the development and implementation of responsive and user-friendly web interfaces Integrate front-end designs with back-end functionality using appropriate technologies Conduct thorough testing and debugging to ensure seamless functionality Assist in website maintenance, updates, and enhancements Stay up-to-date with industry trends and emerging web development technologies Collaborate with cross-functional teams to deliver projects on time and within scope Document technical specifications, project details, and development processes Qualifications:Bachelor's degree in Computer Science, Web Development, or a related field Solid understanding of web development principles and best practices Proficiency in HTML, CSS, and JavaScript Familiarity with front-end frameworks such as Bootstrap or Foundation Basic understanding of back-end development technologies (e.g., PHP, Python, or Ruby) Knowledge of version control systems (e.g., Git) Experience with responsive web design and mobile-first development Strong problem-solving and analytical skills Excellent communication and teamwork abilities Self-motivated with a strong desire to learn and grow as a developer Preferred Qualifications:Previous experience with web development projects (personal or professional) Knowledge of JavaScript frameworks/libraries (e.g., React, Angular, or Vue.js) Familiarity with content management systems (e.g., WordPress, Drupal, or Joomla) Understanding of SEO principles and best practices Experience with web accessibility standards and guidelines Knowledge of web security best practices                                                                         ",
        "About UsFounded in 2014, we offer the industry’s first and only cloud-based, fully-customizable, end-to-end software solution to automate securities-based lending from origination through the life of the loan. By combining thought leadership in suitability and risk management with industry-leading education and the latest technology, Supernova enables advisors to deliver holistic, goals-based advice and to help their clients achieve financial wellness. We partner with the industry’s largest banks, most prominent insurance companies and leading online brokerages to democratize access to securities-based lending and better the entire financial ecosystem.Job DescriptionWe are looking to fill an entry level software engineer to learn from our top technical talent and grow within our company. This person will learn the SDLC practices within Supernova, contribute to diagnosis of potential product related issues, understand the back-end development that drives our platform, and develop skills for hands-on coding within our complex systems.Ideally, this person will grown into a master of technical design and become a crucial tech lead within the organization.This is the perfect opportunity for a passionate software developer to get his or her foot in the door and grow alongside intelligent and helpful individuals.*We are only accepting candidates who are available to start within 1 month of offer acceptance at this time*RESPONSIBILITIES:Remain involved in Supernova's full software development life cycle Hands-on coding for new features and bug fixingContribute to release and deployment of the software component that is within this individuals domainDiagnose potential product issues and provide technical supportGet involved in ad-hoc projects as requested (or interested in)QUALIFICATIONS:BA/BS or MA/MS degree in Computer Science or a related technical field or equivalent practical experienceKnowledge or experience with one or more general purpose programming languages including but not limited to: Java, C/C++, and JavaScript. Python is a plusHands-on practice on Java Spring Framework and Spring bootAbility to handle high priority requests in a timely fashionAbility to adapt to the dynamic and changing nature of a startup company and developer rolesOUR CORE VALUESAt Supernova, we... Form, execute, and communicate new ideas that add value to our employees and customers Strive through obstacles and failures Follow-through on promises or commitments to others, accept responsibility, and answer for actions & decisions Listen to, understand, and support our employees and customers Act with speed, positive attitude, and flexibility Exceed expectations and surpass ourselves every day; we embrace a sense of pride and never stop growing                                                                         ",
        "Job Details:Position: Software Engineer - Jr.Location: Hybrid Opportunity - Des Moines, IA / Charlotte, NCDuration: Contract-to-Hire OpportunityRequired Skills:Responsibilities:Candidate will work closely with their team members mobbing and working through features.Demos of the progress will be provided bi-monthly to the business users.• Technology Modernization: Our target state architecture is serverless AWS. Contribute to modernization efforts, adopting cloud-native architectures and automation frameworks to enhance reliability, scalability, and performance.• Cross-Functional Collaboration: Work closely with global business partners and technology teams.• Technical Support: Learn to provide expert-level support for systems, resolving complex issues across different tech stacks.• Continuous Improvement: Identify opportunities for process optimization and automation, implementing innovative solutions to drive productivity gains.• Experiment, learn and keep up with new technologies and practices.• Periodic on-call support of team’s applications and systems is required.Technologies or Systems:Some of the specific technical skills needed for the role include AWS CDK, typescript, CI/CD pipelines, AWS Cloud fundamentals, Github fundamentals, Java back end or Java Full-stack.Background information on the application(s):This candidate will work on the PRT (Pension Risk Transfer) Deferred Administration team. This team supports applications in Cobol, Java, AWS.Skills:• A successful engineer on the team must be highly collaborative, customer focused, understand and deliver on technical and business strategies, be security minded, display high level of initiative, and willing to grow and learn new skills.• Some of the specific technical skills needed for the role include AWS CDK, typescript, CI/CD pipelines, AWS Cloud fundamentals, Github fundamentals, Java back end or Java Full-stack.                                                                         ",
        "The Red Hat OpenShift Experiences UI team is looking for a front end developer to join the Managed OpenShift console offerings. In this role, you will develop UI components using React JS primarily to support the user experience vision of our interaction designers. You'll need to be both creative and self-motivated, proficient in building web applications, and able to work in a fast-paced, distributed environment. The primary area of expertise for this position is React JS and its associated frameworks (ie. TypeScript, Redux, REST API, CSS, JSX, HTML, etc).Red Hat OpenShift Cluster Manager is a managed service where you can install, modify, operate, and upgrade your Red Hat OpenShift clusters. This service allows you to work with all of your organization’s clusters from a single dashboard. Being part of the OpenShift Cluster Manager products is about passion for technology and development. You'll need to be creative and motivated, proficient in building web applications, and able to work in a fast-paced, distributed environment.What you will doImplement UIs with clean, responsive, and accessible Javascript, Typescript, HTML or CSS as needed to support the design visionWork with UX designers and researchers to bring UI designs from concept to implementation through rapid prototyping and evaluation of design ideasWork with the supporting development teams to gather information about system APIs and help shape the data that is available for UI consumptionConsider an end-to-end user experience that spans product onboarding, usage, and supportCollaborate with peer developers, designers, and product management during brainstorming sessions, design reviews, and code reviews.Work closely with designers during brainstorming, design reviews, and iteration of UI improvementsIterate with the team to improve your solutionsWhat you will bringCollaborative approach to front-end software development with experience building web applications using React JS, Redux, REST, and HTML/CSS.Experience with development tools like Git or WebpackGreat communication and collaboration skills, with a solid attention to detailWillingness to learn new technologies, languages, and systemsThe Following Are Considered a PlusExperience with development tools like TypeScript, Git, webpack, JUnit, and CypressExperience with agile development and open source projectsFamiliarity or interest with OpenShift, Kubernetes, or cloud platforms in generalFamiliarity with GolangThe salary range for this position is $72,080.00 - $115,290.00. Actual offer will be based on your qualifications.Pay TransparencyRed Hat determines compensation based on several factors including but not limited to job location, experience, applicable skills and training, external market value, and internal pay equity. Annual salary is one component of Red Hat’s compensation package. This position may also be eligible for bonus, commission, and/or equity. For positions with Remote-US locations, the actual salary range for the position may differ based on location but will be commensurate with job duties and relevant work experience.About Red HatRed Hat is the world’s leading provider of enterprise open source software solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies. Spread across 40+ countries, our associates have the flexibility to choose the work environment that suits their needs from in-office to fully remote to office-flex. Red Hatters are encouraged to bring their best ideas, no matter their title or tenure. We're a leader in open source because of our open and inclusive environment. We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact. Opportunities are open. Join us.BenefitsComprehensive medical, dental, and vision coverageFlexible Spending Account - healthcare and dependent careHealth Savings Account - high deductible medical planRetirement 401(k) with employer matchPaid time off and holidaysPaid parental leave plans for all new parentsLeave benefits including disability, paid family medical leave, and paid military leaveAdditional benefits including employee stock purchase plan, family planning reimbursement, tuition reimbursement, transportation expense account, employee assistance program, and more!Note: These benefits are only applicable to full time, permanent associates at Red Hat located in the United States.Diversity, Equity & Inclusion at Red HatRed Hat’s culture is built on the open source principles of transparency, collaboration, and inclusion, where the best ideas can come from anywhere and anyone. When this is realized, it empowers people from diverse backgrounds, perspectives, and experiences to come together to share ideas, challenge the status quo, and drive innovation. Our aspiration is that everyone experiences this culture with equal opportunity and access, and that all voices are not only heard but also celebrated. We hope you will join our celebration, and we welcome and encourage applicants from all the beautiful dimensions of diversity that compose our global village.Equal Opportunity Policy (EEO)Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.Red Hat supports individuals with disabilities and provides reasonable accommodations to job applicants. If you need assistance completing our online job application, email application-assistance@redhat.com. General inquiries, such as those regarding the status of a job application, will not receive a reply.                                                                         ",
        "Job DescriptionCaron Engineering (CEI) is a small but growing company working in the global CNC machine industry. We develop and produce accessories that allow CNC machines to work smarter and more efficiently for some of the largest and most advanced companies in the world.Caron Engineering is seeking a full-time Software Engineer who would be responsible for developing cutting-edge software solutions targeting various manufacturing industries.Roles & ResponsibilitiesThe responsibility of this role will include, but may not be limited to the following: Convert ideas and visions into solid technical designs and solutions (application coding and/or physical hardware components) Technical Skills Required C/C++ or C# Web development frameworks (HTML5, CSS, TypeScript, Angular) Cross platform development expertise Scrum development workflow using JIRA including time reporting Advocate of JIRA Software design and development and testing for all CEI components (with assistance) Trouble-shooting skills Knowledge in various industrial protocols including EtherCAT, Modbus TCP, and Ethernet/IP is a plus.  Must also be able to communicate well with on-site work contacts to support any Q&A and troubleshooting; strong verbal and written skills with all colleagues (both internal and external to CEI) Keeps manager informed of important activities and decisions Extensive documentation (manuals) for all design, coding and testing A pleasant personality is necessary as you spend a lot of time with coworkers; works well with a team All employees with disabilities should be able to perform the essential job descriptions with or without reasonable accommodationQualifications External – degrees, certifications, and experience – helps to have a related degree or experience in the field of CNC (computer numerical control) programming; degree in computer science, engineeringSalary & Benefits Starting salary of $60,000 to $75,000 dependent on experience and education Medical and Dental Insurance Health Reimbursement Arrangement (HRA) 401(k) Employee Stock Ownership Plan (ESOP) in which each year of service allows you to share in company growth Paid disability & life insurance Paid time-off starting: vacation hours (80), holiday hours (88-96), sick-time hours (40), and personal time hours (24)For more information, please visit our website at: https://www.caroneng.com/Company DescriptionCaron Engineering (CEI) is a small but growing company working in the global CNC machine industry. We develop and produce accessories that allow CNC machines to work smarter and more efficiently for some of the largest and most advanced companies in the world.Caron Engineering (CEI) is a small but growing company working in the global CNC machine industry. We develop and produce accessories that allow CNC machines to work smarter and more efficiently for some of the largest and most advanced companies in the world.                                                                                 ",
        "Our PurposeWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.Title And SummarySoftware EngineerWho is Mastercard?Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments, and businesses realize their greatest potential.Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all.Solutions ArchitectOverviewSessionM powers many of the world’s leading consumer loyalty and engagement programs with a holistic platform solution and Mastercard's loyalty industry expertise. Brands across industries depend on SessionM technology to build a loyalty marketing ecosystem that acquires and engages with customers.The Solutions Architect will be responsible for developing loyalty solutions based on discussions with the client about their business needs. The Solutions Architect is both technically adept and customer facing, leading discovery sessions to uncover requirements and suggest best of class implementation methods. A person in this role must be well versed in writing technical documentation including but not limited to architecture diagrams, business requirement details, functional requirement details, and software integration documents.RoleLead requirement gathering for business stakeholders and developers through requirement gathering sessions and interviews during initial phase of an implementationCritically evaluate client's infrastructure and be able to translate business requirements into implementation design patternsCreate detailed documentation that will be accepted by the client as validation of the business requirements and project scope. Include user flow diagrams, business & workflow analysis, and architecture diagramsServe as the primary conduit between internal and client technical and development teams during the discovery and design processIdentify project constraints, provide solutions to eliminate risk, and notify stakeholders around issues related to architectureExceptional management skills with the ability to multi-task and manage multiple projects in a cross-functional environment.Ability to communicate with business stakeholders and technology teams.All About YouExperience with designing integration patterns for enterprise architecture- APIs, ETLs, Databases, and Middleware.Expert in REST APIs and SQLExperience with AWS Web Services, Python, and other SaaS products is preferredStrong communication skills -- both verbal and written. You must be able to inform and lead through your designs and documents.Able to support multiple concurrent activities and to interface with external / internal resources.Hands-on, high-energy, detail-oriented, proactive and able to function independently under pressureMust be a fast learnerCorporate Security ResponsibilityEvery Person Working For, Or On Behalf Of, Mastercard Is Responsible For Information Security. All Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And Therefore, It Is Expected That The Successful Candidate For This Position Must:Abide by Mastercard’s security policies and practices;Ensure the confidentiality and integrity of the information being accessed;Report any suspected information security violation or breach, andComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.Mastercard is an inclusive equal opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. In the US or Canada, if you require accommodations or assistance to complete the online application process or during the recruitment process, please contact reasonable_accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.Corporate Security ResponsibilityAll Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And, Therefore, It Is Expected That Every Person Working For, Or On Behalf Of, Mastercard Is Responsible For Information Security And Must:Abide by Mastercard’s security policies and practices;Ensure the confidentiality and integrity of the information being accessed;Report any suspected information security violation or breach, andComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.In line with Mastercard’s total compensation philosophy and assuming that the job will be performed in the US, the successful candidate will be offered a competitive base salary based on location, experience and other qualifications for the role and may be eligible for an annual bonus or commissions depending on the role. Mastercard benefits for full time (and certain part time) employees generally include: insurance (including medical, prescription drug, dental, vision, disability, life insurance), flexible spending account and health savings account, paid leaves (including 16 weeks new parent leave, up to 20 paid days bereavement leave), 10 annual paid sick days, 10 or more annual paid vacation days based on level, 5 personal days, 10 annual paid U.S. observed holidays, 401k with a best-in-class company match, deferred compensation for eligible roles, fitness reimbursement or on-site fitness facilities, eligibility for tuition reimbursement, gender-inclusive benefits and many more.                                                                                 ",
        "Microsoft Cloud Operations + Innovation (CO+I) is the team behind building the Microsoft cloud. Within CO+I, the Datacenter Planning & eXecution Engineering (DPXE) team is responsible for delivering datacenter capacity for Microsoft’s cloud business. We have a portfolio of complex, multi-disciplinary, multi-million, multi-year datacenter construction and lease projects with specific safety, quality, schedule, and cost goals.The DPX Engineering team is responsible for architecting, designing, and building the next generation of connected systems and tools using microservices architecture or ERP platforms to help manage and support critical business functions such as Supply Chain, Cost, Schedule, Networking, Commissioning, Safety, Planning etc. in a real time manner. We are looking for a Software Engineer I to help us deliver against our goal of building robust automation for these functions through well engineered systems and at the same time design and build the next gen, ML based, recommendation engine to enable cost and schedule modeling, supply planning, execution planning etc. while integrating with the bigger CO+I ecosystem.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.ResponsibilitiesPerform End to end Software development life cycle activities (Requirement gathering, fit-gap analysis, system configuration & customization, cutover, Go-live, etc.).Resolve complex system integration challenges working with other members of the team and external teams.Collaborate with stakeholders and demonstrate features developed in an Agile environment.Share learnings and code assets developed with the CO+I engineering team.Embody our Culture and Values QualificationsRequired/Minimum Qualifications:Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.Other RequirementsAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.Preferred/Additional Qualifications2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonBachelor's Degree in Computer Science or related technical field AND 4+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR Master's Degree in Computer Science or related technical field ANDOR equivalent experience.Experience using agile methodologies and/or test-driven development (TDD).Ability to incorporate and understand the needs of our diverse customer base, including customers using assistive technologySoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-payMicrosoft will accept applications for the role until June 8, 2024.#COICareers#COIEngCareers#COIE_DPXEcareersMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.                                                                                 ",
        "About us:Nomic was founded with the purpose of making biology easier to measure. To do this, we have untangled some of the most difficult problems in protein profiling. Our team is combining DNA nanotechnology, high-dimensional flow cytometry, laboratory automation, and machine learning to develop the world’s highest throughput proteomic platform: the nELISA.Since spinning out of McGill University, we have partnered with and provided platform access to dozens of drug discovery groups including GSK, 4 of the top 10 pharmas, and leading biotechs. We have recently launched a state of the art manufacturing and protein profiling facility that enables multiplexed measurement of >2.5M samples a year, generating an effective 500M protein assays in the process.We are building a diverse team of engineers, scientists, and world-changers. We like to break down difficult problems using a first principles approach, often leveraging the latest breakthroughs from across the scientific and technological spectrum to drive our mission forward.Nomic is headquartered in Montreal, Canada with a satellite research lab in Boston, Massachusetts. The majority of our team is based in Montreal and works in a new, shared office/laboratory space with an in-person, but flexible work-from-home, policy.About the role:Our Software team’s mission is to design, build, and support world class software that empowers all nELISA users with proteomics superpowers, including internal at Nomic. Software is integral to our vision of the future, and every aspect of our company today will depend on improving our software stack. Functionally, our software stack includes (i) an in-house developed full-stack LIMS that underpins inventory, manufacturing, lab operations, and that will continue to drive further lab automation going forward; (ii) data pipelines and associated cloud data infrastructure to monitor, decode, and quantitatively analyze flow cytometry nELISA experiments; and (iii) a customer-facing web portal that enables nELISA users to visualize and analyze their proteomic datasets at scale seamlessly in the browser.As a Software Engineer, you will be responsible for building all core components of the nELISA software stack, and scaling them as needed, often as a member of cross-functional projects working closely with our broader Engineering, Commercial, and Lab Operations teams. You will also get to build internal tools that create and support data-driven feedback loops for our teammates in R&D, automation, manufacturing, customer success, and bioinformatics. In short, you will get to make substantive changes and build the core components of the software stack that underpins the nELISA’s technological flywheel.You will therefore get to play a critical, first-hand role in developing core improvements to the LIMS, web portal, and data infrastructure for handling all things nELISA data. In particular, you will:Write sub-components of our software stack from scratch, such as database schemas, analysis pipelines and new analysis algorithms, cloud infrastructure and related IaC, full stack web interfaces, machine learning models, and APIs that will be consumed both by our own services, and by customers. Develop improved internal tools for our LIMS, and software for our R&D teams, in order to increase operations and R&D velocity in the lab, including developing and implementing an electronic lab notebooks (ELN) plan tailor fit to our profiling and manufacturing lab operations. Write modular software that we can use to create efficient analysis pipelines and internal QC tools, making use of existing libraries, open source platforms, and commercial options as best suited to the challenges at hand. Build better interfaces to the tools that are available out-of-the-box from our robotic lab automation equipment suppliers, and extend these capabilities going forward so as to enable our lab teams to interface with our software stack as seamlessly as possible. Contribute improvements to the codebase that enable us to further scale up our nELISA decoding and analysis pipelines, write test cases, integrate components of the stack with appropriate monitoring and analytics, and set up robust CICD infrastructure when appropriate. Deploy and scale our data pipelines for processing flow cytometry data into quantitative protein concentrations. This will be done in close collaboration between our Data Engineering and Software Engineering teams. This role will involve substantial communication and teamwork not just within our software engineering team at Nomic, but also with the broader range of internal users of the LIMS, data portal, and data pipeline software, including customers at times. What we’re looking for - and please note that we are looking for hires across Jr to Sr levels:4+ years of full stack software engineering experience. 2+ years experience writing code in the biotech and/or life sciences industry. Technical skills in one of algorithm development, signal processing, image analysis, computational biology and/or bioinformatics. Experience developing new data analysis pipelines and algorithms for biochemical assays (or similar), such as ELISA, flow cytometry, mass spec, and/or NGS. Bachelors or Masters degree in engineering or computer science (or related field), or equivalent industry experience. Experience working in Python as part of a small software team, ability to rapidly prototype and code modular software to improve and extend an existing codebase. Excellent communication skills (written, verbal, and in a codebase) and an independent problem solver. Experience developing at least one of the following: Built extensions on an existing LIMS in close collaboration with scientists as your end-users (e.g. Benchling), written software that interfaces with lab equipment (such as liquid handers or cytometers), and/or established high performance data pipelines and data stores for biological data that support user workflows (data lakes, viz layers, etc). Join us if you:Connect deeply with our mission, ambition and sense of duty. Our mission isn’t marketing flash: we developed our technology to better measure biology and discover biomarkers for early disease detection. We firmly believe we will be successful in literally eradicating certain diseases by enabling them to be diagnosed earlier. We also believe that our hard work to bring this technology to its full potential is our duty. Are up for a challenge and want to grow: We are a team of problem-solvers, and we continually put ourselves to the test and go into the unknown. We have a growth mindset, both on hard and soft skills, and we rely on each other to give critical and candid feedback to ensure that we can all reach our full potential. Want to be at the cutting-edge of biotechnology. The nELISA is a new tool that leverages DNA nanotechnology to generate proteomic data more efficiently than ever before. You get to design and build the data pipelines that will support the scaling of this technology going forward. Love writing code and working with bioscience users, and want to drive improvements in the lives of scientists from a full-stack software development perspective. Prefer working and communicating within a diverse cross-functional team. You would get to interface with teammates from the R&D, Engineering, Operations, and Commercial teams on a daily basis, joining a collaborative, diverse, and inclusive team where your ideas will be valued. Want the responsibility of addressing some of our hardest problems. Software is one of our core competencies and writing code at Nomic has the potential for widespread impact, both for all aspects of our company internally, and directly for our customers who are using nELISA data to carry out life saving scientific research that will ultimately impact patients. If you are passionate about writing full stack software for biology, want to drive innovation in proteomics, and are eager to make a meaningful impact in the world, we invite you to apply and join us on our journey to redefine proteomics and the understanding of biology.                                                                                 ",
        "Since 2010 Synergisticit has helped Jobseekers differentiate themselves by providing candidates the requisite skills and experience to outperform at interviews and clients. Here at SynergisticIT We just don't focus on getting you a Job we make careers.All Positions are open for all visas and US citizensWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart lab s etc to name a few.We have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, Java Full stack developers, Python/Java developers, Data analysts/ Data Scientists, Machine Learning engineers for full time positions with clients.Who Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and looking to make their careers in the Tech Industry.We assist in filing for STEM extension and also for H1b and Green card filing to CandidatesIf you applied for a job and got emails from our Job Placement Program team please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team.please check the below links to see success outcomes of our candidates and our participation at different Tech industry events and how we are different from other organizations in helping Jobseekers secure Tech careers(url removed)We regularly interact with the Top Tech companies to give our candidates a competitive advantage-Please see us exhibiting at Oracle Cloud world /Oracle Java one (Las vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023(url removed)(url removed)For preparing for interviews please visit (url removed)We are looking for the right matching candidates for our clientsPlease apply via the job postingREQUIRED SKILLS For Java /Full Stack/Software ProgrammerBachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, ITHighly motivated, self-learner, and technically inquisitiveExperience in programming language Java and understanding of the software development life cycleProject work on the skillsKnowledge of Core Java , javascript , C++ or software programmingSpring boot, Microservices, Docker, Jenkins and REST API's experienceExcellent written and verbal communication skillsFor data Science/Machine learning PositionsRequired SkillsBachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, ITProject work on the technologies neededHighly motivated, self-learner, and technically inquisitiveExperience in programming language Java and understanding of the software development life cycleKnowledge of Statistics, SAS, Python, Computer Vision, data visualization toolsExcellent written and verbal communication skillsPreferred skills: NLP, Text mining, Tableau, PowerBI, SAS, TensorflowIf you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team who only connect with candidates who are matching client requirements.No phone calls please. Shortlisted candidates would be reached out. No third party or agency candidates or c2c candidates                                                                                 ",
        "This is a remote position.Junior Software Engineer - Remote Job, 1+ Year ExperienceAnnual Income: $63K - $77KA valid work permit is necessary in the USAbout us: Patterned Learning is a platform that aims to help developers code faster and more efficiently. It offers features such as collaborative coding, real-time multiplayer editing, and the ability to build, test, and deploy directly from the browser. The platform also provides tightly integrated code generation, editing, and output capabilities.Are you a passionate mobile developer who wants to create impactful experiences that make a real difference? Do you thrive in a collaborative environment and enjoy tackling complex technical challenges? If so, then this Software Engineer - Mobile Experience Management role at Samsara is the perfect opportunity for you!At Samsara, we're building the connected operations cloud that helps businesses running the physical world – from transportation and logistics to manufacturing and construction – operate more safely, efficiently, and sustainably.The Mobile Experience Management (MEM) team plays a vital role in this mission. Our MEM solution empowers customers to manage their mobile devices seamlessly, optimizing functionality and features for their specific needs.In this critical role, you'll join our talented MEM team and play a key part in developing and maintaining our industry-leading mobile application.Here's what you'll do:Mobile Mastermind: Design, develop, and implement high-quality, scalable, and maintainable mobile features for the Android platform. Full-Stack Superhero: Collaborate with product managers, designers, and infrastructure engineers to architect, build, test, and deliver complete features across front-end, back-end, and mobile domains. Performance Champion: Continuously assess and improve the performance, reliability, and user experience of our mobile applications. To be successful, you'll need:A Bachelor's degree in Computer Science/Engineering or equivalent practical experience. 1+ years of relevant industry experience in software development. 1+ years of experience in native Android development (Kotlin is required). Strong programming and coding fundamentals. Bonus points if you have:Experience with a public cloud platform like AWS. Experience with front-end technologies (e.g., React, Redux, TypeScript). A genuine curiosity about our customers and a passion for improving their daily experience. A love for shipping features that are immediately used by real users. A desire to iterate on new products based on customer feedback. At Samsara, we offer:The chance to make a real-world impact on industries that are crucial to our everyday lives. The opportunity to build for scale, working with cutting-edge technologies that empower millions of connected devices. A culture of continuous learning where you'll be encouraged to grow your skills and tackle new challenges. A commitment to customer-centricity, where you'll have the opportunity to directly influence product development based on user feedback. A collaborative and supportive work environment where you'll be surrounded by passionate and talented teammates. Ready to leverage your mobile development expertise and join a mission-driven company? Apply today!Why Patterned Learning LLC?Patterned Learning can provide intelligent suggestions, automate repetitive tasks, and assist developers in writing code more effectively. This can help reduce coding errors, improve productivity, and accelerate the development process.Pattern recognition is particularly relevant in the context of coding. Neural networks, especially deep learning models, are commonly employed for pattern detection and classification tasks. These models simulate human decision-making and can identify patterns in data, making them well-suited for tasks like code analysis and generation.                                                                         ",
        "The Red Hat OpenShift Experiences UI team is looking for a front end developer to join the Managed OpenShift console offerings. In this role, you will develop UI components using React JS primarily to support the user experience vision of our interaction designers. You'll need to be both creative and self-motivated, proficient in building web applications, and able to work in a fast-paced, distributed environment. The primary area of expertise for this position is React JS and its associated frameworks (ie. TypeScript, Redux, REST API, CSS, JSX, HTML, etc).Red Hat OpenShift Cluster Manager is a managed service where you can install, modify, operate, and upgrade your Red Hat OpenShift clusters. This service allows you to work with all of your organization’s clusters from a single dashboard. Being part of the OpenShift Cluster Manager products is about passion for technology and development. You'll need to be creative and motivated, proficient in building web applications, and able to work in a fast-paced, distributed environment.What you will doImplement UIs with clean, responsive, and accessible Javascript, Typescript, HTML or CSS as needed to support the design visionWork with UX designers and researchers to bring UI designs from concept to implementation through rapid prototyping and evaluation of design ideasWork with the supporting development teams to gather information about system APIs and help shape the data that is available for UI consumptionConsider an end-to-end user experience that spans product onboarding, usage, and supportCollaborate with peer developers, designers, and product management during brainstorming sessions, design reviews, and code reviews.Work closely with designers during brainstorming, design reviews, and iteration of UI improvementsIterate with the team to improve your solutionsWhat you will bringCollaborative approach to front-end software development with experience building web applications using React JS, Redux, REST, and HTML/CSS.Experience with development tools like Git or WebpackGreat communication and collaboration skills, with a solid attention to detailWillingness to learn new technologies, languages, and systemsThe Following Are Considered a PlusExperience with development tools like TypeScript, Git, webpack, JUnit, and CypressExperience with agile development and open source projectsFamiliarity or interest with OpenShift, Kubernetes, or cloud platforms in generalFamiliarity with GolangThe salary range for this position is $72,080.00 - $115,290.00. Actual offer will be based on your qualifications.Pay TransparencyRed Hat determines compensation based on several factors including but not limited to job location, experience, applicable skills and training, external market value, and internal pay equity. Annual salary is one component of Red Hat’s compensation package. This position may also be eligible for bonus, commission, and/or equity. For positions with Remote-US locations, the actual salary range for the position may differ based on location but will be commensurate with job duties and relevant work experience.About Red HatRed Hat is the world’s leading provider of enterprise open source software solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies. Spread across 40+ countries, our associates have the flexibility to choose the work environment that suits their needs from in-office to fully remote to office-flex. Red Hatters are encouraged to bring their best ideas, no matter their title or tenure. We're a leader in open source because of our open and inclusive environment. We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact. Opportunities are open. Join us.BenefitsComprehensive medical, dental, and vision coverageFlexible Spending Account - healthcare and dependent careHealth Savings Account - high deductible medical planRetirement 401(k) with employer matchPaid time off and holidaysPaid parental leave plans for all new parentsLeave benefits including disability, paid family medical leave, and paid military leaveAdditional benefits including employee stock purchase plan, family planning reimbursement, tuition reimbursement, transportation expense account, employee assistance program, and more!Note: These benefits are only applicable to full time, permanent associates at Red Hat located in the United States.Diversity, Equity & Inclusion at Red HatRed Hat’s culture is built on the open source principles of transparency, collaboration, and inclusion, where the best ideas can come from anywhere and anyone. When this is realized, it empowers people from diverse backgrounds, perspectives, and experiences to come together to share ideas, challenge the status quo, and drive innovation. Our aspiration is that everyone experiences this culture with equal opportunity and access, and that all voices are not only heard but also celebrated. We hope you will join our celebration, and we welcome and encourage applicants from all the beautiful dimensions of diversity that compose our global village.Equal Opportunity Policy (EEO)Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.Red Hat supports individuals with disabilities and provides reasonable accommodations to job applicants. If you need assistance completing our online job application, email application-assistance@redhat.com. General inquiries, such as those regarding the status of a job application, will not receive a reply.                                                                         ",
        "Position: Junior Full Stack Software Engineer  Mode: Long-Term Contract  Remote Work  Profile:  Junior level software engineer with knowledge of Java, JavaScript (50/50 split between the two) - the legacy code is java and new code is Javascript and work on both apps, Node.js and AWS per the grid below. Candidate must have worked in agile and AWS environment. Must have working knowledge in AWS w/Java and Node.js.SummaryFull Stack Software Engineer must be a skilled engineer with an unwavering passion for excellence in Software Engineering and drive to transform that passion into consistent excellence in product development. The candidate will partner with Product Owners/Architects, Developers, and other Software Engineers to help design, define, implement functional features, system level validation and verify features of product development. Qualified candidates will show an aptitude learning and implementation of advanced software engineering practices in AWS, Microservices environment to solve complex problems with a mission to release high quality software that is resilient and optimally performing.Candidates will be engaged in both software development and quality engineering as a senior full stack engineer.Responsibilities Builds, tests, deploys, and maintains production Java code for complex web-based applications using J2E, Spring, Hibernate, JavaScript, Python languages. Incorporates Cloud technologies on new application development to include micro-services and AWS services such as lambda, S3, SQS, SNS, and DynamoDB.  Works in DevOps agile teams primarily in AWS technology environment  Development of code and test automation suite to support security features, technical scoping ensuring that features deliver the expected functionality with high quality.  Ensures that continuous integration is performed on the application source code and constantly seeks to enhance the continuous integration methods of the development team to ensure extremely high quality of code.  Responsible for support of and coordinating with other Engineers, Architects and teams including other technology teams such as a User Experience team or an infrastructure team.  Required Skills  Bachelors degree required.  Experience in working with AWS services like Lambda, DynamoDB, Athena, Glue, Redis, OpenSearch, Aurora, Cloud Front, API Gateway etc.  Experience in Java, J2EE, REST, Spring, JPA/Hibernate, SQL and NoSQL databases applied to develop web applications.  Experience in developing backend components using Python, NodeJS, Typescript.  Experience in developing unit tests, QA automation, performance scripts using Jest, playwright, JMeter etc.  Exposure to DevOps tools and automation scripts for IAC using AWS CDK, ansible, Cloud Formation.  Good communication skills. Must be adaptable, open minded and sensible for the team needs. Preferred Skills Working experience with performance tuning and stress testing  AWS DevOps engineering experience in creating ops scripts and infrastructure maintenance                                                                         ",
        "About us:Nomic was founded with the purpose of making biology easier to measure. To do this, we have untangled some of the most difficult problems in protein profiling. Our team is combining DNA nanotechnology, high-dimensional flow cytometry, laboratory automation, and machine learning to develop the world’s highest throughput proteomic platform: the nELISA.Since spinning out of McGill University, we have partnered with and provided platform access to dozens of drug discovery groups including GSK, 4 of the top 10 pharmas, and leading biotechs. We have recently launched a state of the art manufacturing and protein profiling facility that enables multiplexed measurement of >2.5M samples a year, generating an effective 500M protein assays in the process.We are building a diverse team of engineers, scientists, and world-changers. We like to break down difficult problems using a first principles approach, often leveraging the latest breakthroughs from across the scientific and technological spectrum to drive our mission forward.Nomic is headquartered in Montreal, Canada with a satellite research lab in Boston, Massachusetts. The majority of our team is based in Montreal and works in a new, shared office/laboratory space with an in-person, but flexible work-from-home, policy.About the role:Our Software team’s mission is to design, build, and support world class software that empowers all nELISA users with proteomics superpowers, including internal at Nomic. Software is integral to our vision of the future, and every aspect of our company today will depend on improving our software stack. Functionally, our software stack includes (i) an in-house developed full-stack LIMS that underpins inventory, manufacturing, lab operations, and that will continue to drive further lab automation going forward; (ii) data pipelines and associated cloud data infrastructure to monitor, decode, and quantitatively analyze flow cytometry nELISA experiments; and (iii) a customer-facing web portal that enables nELISA users to visualize and analyze their proteomic datasets at scale seamlessly in the browser.As a Software Engineer, you will be responsible for building all core components of the nELISA software stack, and scaling them as needed, often as a member of cross-functional projects working closely with our broader Engineering, Commercial, and Lab Operations teams. You will also get to build internal tools that create and support data-driven feedback loops for our teammates in R&D, automation, manufacturing, customer success, and bioinformatics. In short, you will get to make substantive changes and build the core components of the software stack that underpins the nELISA’s technological flywheel.You will therefore get to play a critical, first-hand role in developing core improvements to the LIMS, web portal, and data infrastructure for handling all things nELISA data. In particular, you will:Write sub-components of our software stack from scratch, such as database schemas, analysis pipelines and new analysis algorithms, cloud infrastructure and related IaC, full stack web interfaces, machine learning models, and APIs that will be consumed both by our own services, and by customers. Develop improved internal tools for our LIMS, and software for our R&D teams, in order to increase operations and R&D velocity in the lab, including developing and implementing an electronic lab notebooks (ELN) plan tailor fit to our profiling and manufacturing lab operations. Write modular software that we can use to create efficient analysis pipelines and internal QC tools, making use of existing libraries, open source platforms, and commercial options as best suited to the challenges at hand. Build better interfaces to the tools that are available out-of-the-box from our robotic lab automation equipment suppliers, and extend these capabilities going forward so as to enable our lab teams to interface with our software stack as seamlessly as possible. Contribute improvements to the codebase that enable us to further scale up our nELISA decoding and analysis pipelines, write test cases, integrate components of the stack with appropriate monitoring and analytics, and set up robust CICD infrastructure when appropriate. Deploy and scale our data pipelines for processing flow cytometry data into quantitative protein concentrations. This will be done in close collaboration between our Data Engineering and Software Engineering teams. This role will involve substantial communication and teamwork not just within our software engineering team at Nomic, but also with the broader range of internal users of the LIMS, data portal, and data pipeline software, including customers at times. What we’re looking for - and please note that we are looking for hires across Jr to Sr levels:4+ years of full stack software engineering experience. 2+ years experience writing code in the biotech and/or life sciences industry. Technical skills in one of algorithm development, signal processing, image analysis, computational biology and/or bioinformatics. Experience developing new data analysis pipelines and algorithms for biochemical assays (or similar), such as ELISA, flow cytometry, mass spec, and/or NGS. Bachelors or Masters degree in engineering or computer science (or related field), or equivalent industry experience. Experience working in Python as part of a small software team, ability to rapidly prototype and code modular software to improve and extend an existing codebase. Excellent communication skills (written, verbal, and in a codebase) and an independent problem solver. Experience developing at least one of the following: Built extensions on an existing LIMS in close collaboration with scientists as your end-users (e.g. Benchling), written software that interfaces with lab equipment (such as liquid handers or cytometers), and/or established high performance data pipelines and data stores for biological data that support user workflows (data lakes, viz layers, etc). Join us if you:Connect deeply with our mission, ambition and sense of duty. Our mission isn’t marketing flash: we developed our technology to better measure biology and discover biomarkers for early disease detection. We firmly believe we will be successful in literally eradicating certain diseases by enabling them to be diagnosed earlier. We also believe that our hard work to bring this technology to its full potential is our duty. Are up for a challenge and want to grow: We are a team of problem-solvers, and we continually put ourselves to the test and go into the unknown. We have a growth mindset, both on hard and soft skills, and we rely on each other to give critical and candid feedback to ensure that we can all reach our full potential. Want to be at the cutting-edge of biotechnology. The nELISA is a new tool that leverages DNA nanotechnology to generate proteomic data more efficiently than ever before. You get to design and build the data pipelines that will support the scaling of this technology going forward. Love writing code and working with bioscience users, and want to drive improvements in the lives of scientists from a full-stack software development perspective. Prefer working and communicating within a diverse cross-functional team. You would get to interface with teammates from the R&D, Engineering, Operations, and Commercial teams on a daily basis, joining a collaborative, diverse, and inclusive team where your ideas will be valued. Want the responsibility of addressing some of our hardest problems. Software is one of our core competencies and writing code at Nomic has the potential for widespread impact, both for all aspects of our company internally, and directly for our customers who are using nELISA data to carry out life saving scientific research that will ultimately impact patients. If you are passionate about writing full stack software for biology, want to drive innovation in proteomics, and are eager to make a meaningful impact in the world, we invite you to apply and join us on our journey to redefine proteomics and the understanding of biology.                                                                         ",
        "We are the Qualitative Insights Platform (QuIP) team – part of the Office Growth Activation - Insights (OGAI) powering engineering capability and customer lifecycle – builds transformative capabilities that help Microsoft teams immerse in understanding and empowering the customer via data. We deliver innovative modern data solutions and services which enable new Office experiences at service velocity, intelligent analysis and products, and richly informed hypothesis-driven agility – driving business success through customer engagement and satisfaction.We are looking for a Software Engineer. We offer a fantastic and fun team environment with commitment to people and inclusion. We celebrate team cultural values of being:  Customer-dedicated(and helping everyone else live this)  Exceptional partners – designing and co-developing capabilities for and access dozens (to hundreds) of teams  Committed to continual learning and growing in building a high-trust, collaborative, diverse and deeply inclusive team environment.   Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.In alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.ResponsibilitiesYou will work on building survey experiences across Web, Windows, Mac and Android. You will have access to cutting-edge technologies, will find best of the breed solution for our users and customers, and will lead with code. When you see something that we could be doing better let us know and help us improve! YouPossess great judgement, solid engineering skills, and ability and desire to learn and go deep into new technologies.  Are a versatile engineer who seamlessly can work across different platforms.  Are passionate about designing and building compelling solutions to connect millions of users with the power of Microsoft 365.  Are methodical about being analytical and data-informed and learn by experimenting. Are a thought leader and a change agent.  Are committed about great customer experiences and outcomes. Are looked up as a technical go-to person in your organization. Are a great communicator and capable of clearly conveying complex issues, ideas, and concepts.  Embody our Culture and Values QualificationsRequired QualificationsBachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.Additional Or Preferred QualificationsCoding skills in C++, C#, Java. Any language experience is fine if you are detail-focused with design principles and implementation skills.  2+ years of experience or working knowledge of JavaScript/Node.js/React or another similar web stack. Experience of working on highly scalable services. Experience of working on data pipelines such as Cosmos, Kusto, Azure Data Factory, etc. Experience of working on Win32, iOS/Mac or Android is considered a plus. Experience working collaboratively with a team of engineers and a passion for learning. A computer science background (BS degree or equivalent experience).  Software Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.Certain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here:https://careers.microsoft.com/us/en/us-corporate-payMicrosoft will accept applications for the role until June 10, 2024.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.                                                                                 ",
        "Planned Systems International (PSI) is currently seeking a Junior Web Developer to support a Department of Homeland Security (DHS) program as a full-time employee.Essential Functions And Job ResponsibilitiesSuccessful candidate will provide website design, development, testing, management and support of the hardware/software infrastructure for a web-based portal for our government client. Essential functions will include, but not be limited to: Performing all aspects of the development tasks, including front-end, back-end, and database development.  Managing resources to ensure timely and successful deliveries.  Working with clients and review panels to identify recommendations for the appropriate technical, business and human factors solutions.  Commitment to clear and quality communications between team and client product managers.  Commitment to promoting a collaborative work environment with team members and customers.  Develop and maintain web-enabled capabilities and custom applications.  Lead staff in defining and tracking project requirements, plans, and schedules.  Commitment to delivery of quality products. Minimum Requirements Bachelor’s degree in Computer Science, Engineering, or closely related field.  Strong understanding of user interface design principles, with proven track record of creative web site development in accordance with the design specifications, user interface style guides and established usability standards.  Must have strong experience working with a variety of technology and the ability to multi-task between different projects and workflow stages.  Must have experience communicating directly with end users and the ability to gather requirements.  Experience analyzing business product needs, recommending, then possibly implementing, effective software solutions in a timely manner.  Experience analyzing core standards for software development, and maintaining an effective process for support.  Experience providing guidance and leadership to other developers and development teams.  U.S. Citizenship is required. Candidates selected must be able to successfully pass a client background investigation. Company BenefitsPSI offers full-time, benefits eligible employees a competitive total compensation package that includes paid leave, and options for employer sponsored group medical, dental, vision, short-term and long-term disability, life insurance, AD&D coverage, legal services, identity theft, and accident insurance. Flexible spending account and health saving account options offer pre-tax savings for qualified medical, dental, and vision expenses. The company sponsored 401(k) retirement plan has an employer contribution match that is immediately vested. We invest in the professional growth of our employees through professional courses, certifications, and tuition reimbursement programs. EEO Commitment It is company policy to promote equal employment opportunities. All personnel decisions, including, but not limited to, recruiting, hiring, training, promotion, compensation, benefits, and termination, are made without regard to race, color, religion, age, sex, sexual orientation, pregnancy, gender identity, genetic information, national origin, citizenship status, veteran status, protected veteran status, disability, or any other characteristic protected by applicable federal, state, or local law.Reasonable accommodations for applicants and employees with disabilities will be provided. If a reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact Human Resources by emailing HRDepartment@plan-sys.com , or by dialing 703-575-8400.                                                                                 ",
        "DescriptionAt Amazon, we're working to create the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven leaders to help us deliver a great customer experience. We are looking for a dynamic, customer-obsessed and innovative SDE to join our Amazon Private Brands team. Our Private Brands offer customers outstanding quality, at great prices and we are looking for a SDE to deliver systems that will help customers discover our Private Brands products.Are you looking for a Software Development Engineer position building systems that drive Amazon’s website experience for millions of customers, across a catalog of billions of products?An information-rich and accurate product catalog is a strategic asset for Amazon and we use a wide-array of approaches to keep improving the customer experience. This role will partner with core catalog team to enhance existing meta-data platform capabilities that will allow managing brand level knowledge within the catalog systems. The platform will be the single source of truth for catalog data, cross marketplace mappings and validations with deep integration with listing tools, ASIN localization and post ASIN setup quality auditing platform.As a Software Development Engineer on the team you will take ownership over the software design, documentation, development, engineering approach, delivery and support of systems built natively in AWS. In this role you will collaborate with leaders, work backwards from customers, identify problems, propose innovative solutions, relentlessly raise standards, and have a positive impact on hundreds of millions of customersWe are open to hiring candidates to work out of one of the following locations:Seattle, WA, USABasic Qualifications 1+ years of non-internship professional software development experience Experience programming with at least one software programming languagePreferred Qualifications Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $99,500/year in our lowest geographic market up to $200,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.Company - Amazon.com Services LLCJob ID: A2643104                                                                                 ",
        "Benefits:401(k)401(k) matchingCompany partiesCompetitive salaryDental insuranceFlexible scheduleFree food & snacksHealth insurancePaid time offParental leaveTraining & developmentVision insuranceJUNIOR SOFTWARE ENGINEER (Hybrid Position-In Office Tuesday through Thursday)The Junior Software Engineer will be part of the team responsible for designing, developing, and operating the applications that make Throtle’s data onboarding solution work. The ideal candidate can work with teammates in troubleshooting problems, designing solutions, and assessing situations in real time. Our team is empowered to keep our fast-paced, high-volume processing environment operational for our clients and partners.Primary ResponsibilitiesCreate tools and solutions to manage and monitor our rapidly growing operations.Be involved in real-time assessment of issues and help develop solutionsBuild and design solutions that mitigate risk and increase efficienciesAutomate processes and sub-processes to enable greater scale and speedMaintaining our existing code. Take part in performance & capacity monitoring and planningKNOWLEDGE AND SKILL REQUIREMENTSAt least 2 -3 years of experience Significant proficiency in one or more of these languages- Java, Python, GolangExperience with databases – PostgreSQL, Oracle, or Microsoft SQL Server.Proficiency in Restful API Development Experience interacting with AWS CLI and AWS ConsoleKnowledge of software architecture, data structures, modern design patterns and network protocols Ability to identify problems, and effectively communicate solutions to peers and managementOTHER VALUABLE SKILLSExperience with data flow and queue management using tools like Kafka and Flume Experience in front end technologies including JavaScript, CSS3 and HTML5 to include libraries such as React Js and Angular. Experience in Linux SysAdminExposure to NoSQL/Big Data: Hadoop, HBase, Cassandra, MongoDBHands on experience with a CI/CD environmentExperience with configuration management and automation tools like Ansible, Chef, or Puppet.About Throtle:Throtle is a leading identity company trusted by the world’s top brands and agencies located in Red Bank, NJ. At Throtle, we empower brands at scale with true individual-based marketing using a data-centric identity and onboarding approach.Throtle is a company that truly values its employees and their work-life balance. We offer a comprehensive, competitive, and inclusive set of health, financial and other benefits that support your total well-being:Competitive compensation.Comprehensive benefits include Medical, Dental, and Vision. Life insurance.Long-Term DisabilityA generous PTO program.A 401k plan supported by a company match.Half Day Summer Fridays (close at 1 p.m. Memorial Day to Labor Day).Early Fridays (office closes at 3 p.m.). Hybrid Schedule (Mondays and Fridays WFH)The office is closed between Christmas and New Year.Company-sponsored lunch at least 1x a month. And much MORE!Throtle is an equal-opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws. Flexible work from home options available.                                                                                 ",
        "OverviewWe are seeking a full-time Software Engineer 1 in our Chandler, AZ location. In this role, you will be responsible for building upon existing software solutions to develop basic software for Garmin products and/or applications.Essential FunctionsPerforms new product and/or application software design and development as well as maintenance activities for products and/or applications already in production using C, C++, C#, Java, assembly language, or other selected languagesTroubleshoots basic issue reports, reproduces issues, evaluates technical cause and implements and tests software solutionsIdentifies and resolves defects of basic scope using proper engineering tools and techniques such as debuggers, emulators, simulators, and logic analyzersApplies design standards and procedures using appropriate engineering tools to document and implement basic designs in an organized mannerBasic QualificationsBachelor’s Degree in Computer Science, Electrical Engineering, Computer Engineering, Software Engineering, Aerospace Engineering, Math, Physics or related field OR an equivalent combination of education and experienceExcellent academics (cumulative GPA greater than or equal to 3.0 as a general rule)Demonstrated knowledge, education, experience and/or training necessary to develop basic software in C, C++, C#, Java, assembly language, or other selected languagesDesired QualificationsOutstanding academics (cumulative GPA greater than or equal to 3.5)Previous work or internship experience in design, particularly for consumer productsGarmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability.This position is eligible for Garmin's benefit program. Details can be found here: Garmin Benefits                                                                         ",
        "Eulerity is a rapidly growing technology company providing marketing automation to small businesses and franchise systems globally.Your Role:Development and testing of new features and general codebase maintenanceCreating/Reviewing pull requests and implementing feedbackCollaboration with other developers for implementing best practices, understanding data models, and integrating with APIsCollaboration our designers for understanding the user experience and implementing Figma designsAssisting with project documentation and preparing notes about upcoming featuresAbout You:A self-starter who is able to take ownership of a project and work both independently and collaboratively with othersGood attention to detail and initiativeStrong communication skills and ability to work within a teamRequirements:Experience with React (professional or projects)Strong grasp of HTML/CSS/Javascript/Typescript FundamentalsWork in a hybrid environment (in-office and at home)Commit to 40 hours/weekBenefits:Pay $15-$17/hourMentorship with regular peer review sessionsFree lunchExpected Start date: ASAP                                                                                 ",
        "Company DescriptionAt ServiceNow, our technology makes the world work for everyone, and our people make it possible. We move fast because the world can’t wait, and we innovate in ways no one else can for our customers and communities. By joining ServiceNow, you are part of an ambitious team of change makers who have a restless curiosity and a drive for ingenuity. We know that your best work happens when you live your best life and share your unique talents, so we do everything we can to make that possible. We dream big together, supporting each other to make our individual and collective dreams come true. The future is ours, and it starts with you.With more than 7,700+ customers, we serve approximately 85% of the Fortune 500®, and we're proud to be one of FORTUNE 100 Best Companies to Work For® and World's Most Admired Companies™.Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow.Unsure if you meet all the qualifications of a job description but are deeply excited about the role? We still encourage you to apply! At ServiceNow, we are committed to creating an inclusive environment where all voices are heard, valued, and respected. We welcome all candidates, including individuals from non-traditional, varied backgrounds, that might not come from a typical path connected to this role. We believe skills and experience are transferrable, and the desire to dream big makes for great candidates.Job DescriptionWhat you get to do in this role:Build high-quality, clean, scalable and reusable code by enforcing best practices around software engineering architecture and processes (Code Reviews, Unit testing, etc.)Work with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality product to our users.Design software that is simple to use to allow customers to extend and customize the functionality to meet their specific needsHelp design and implement new products and features while also enhancing the existing product suiteQualificationsTo be successful in this role you have:0-2+ years of experience with Java or a similar OO languagePassion for JavaScript and the Web as a platform, reusability, and componentizationExperience with data structures, algorithms, object-oriented design, design patterns, and performance/scale considerationsExperience with any of the modern UI frameworks like Angular, React or VueAnalytical and design skillsWorking knowledge and ability to use tools to assist with daily tasks (IDE, debugger, build tools, source control, ServiceNow instances, profilers, system administration/Unix tools)FD21For positions in California (outside of the Bay Area), we offer a base pay of $109,400 - $169,600, plus equity (when applicable), variable/incentive compensation and benefits. Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure. Please note that the base pay shown is a guideline, and individual total compensation will vary based on factors such as qualifications, skill level, competencies and work location. We also offer health plans, including flexible spending accounts, a 401(k) Plan with company match, ESPP, matching donations, a flexible time away plan and family leave programs (subject to eligibility requirements). Compensation is based on the geographic location in which the role is located, and is subject to change based on work location. For individuals who will be working in the Bay Area, there is a pay enhancement for positions located in that geographical area; please contact your recruiter for additional information.Additional InformationServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law.At ServiceNow, we lead with flexibility and trust in our distributed world of work. Click here to learn about our work personas: flexible, remote and required-in-office.If you require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at talent.acquisition@servicenow.com for assistance.For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.Please Note: Fraudulent job postings/job scams are increasingly common. Click here to learn what to watch out for and how to protect yourself. All genuine ServiceNow job postings can be found through the ServiceNow Careers site.From Fortune. © 2022 Fortune Media IP Limited All rights reserved. Used under license.Fortune and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, ServiceNow.                                                                                 ",
        "This is a remote position. Full Stack Web Developer (1 year experience, remote)Be part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process. Hiring Type: Full-Time Base Salary: $57K-$67K Per Annum.Description:This position is ideal for individuals who are passionate about both front-end and back-end development and want to gain valuable experience in a supportive and collaborative environment.Responsibilities:Collaborate with the development team to design, develop, and maintain web applications Implement responsive and user-friendly front-end designs using HTML, CSS, and JavaScript Develop server-side code and APIs using programming languages such as Python, Ruby, or Node.js Design and maintain databases and perform database queries for data retrieval and manipulation Write clean, modular, and efficient code for both front-end and back-end components Participate in code reviews and provide constructive feedback Troubleshoot and debug issues to ensure optimal performance and user experience Stay up-to-date with emerging web technologies and industry trends Contribute to improving the overall web development process Requirements:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience) Strong knowledge of HTML5, CSS3, and JavaScript Experience with front-end frameworks (such as React, Angular, or Vue.js) Proficiency in at least one server-side programming language (Python, Ruby, Node.js, etc.) Familiarity with databases and SQL Understanding of RESTful APIs and web services Experience with version control systems (e.g., Git) Good problem-solving and analytical skills Excellent communication and teamwork abilities Preferred Qualifications:Familiarity with back-end frameworks (such as Django, Ruby on Rails, Express, etc.) Knowledge of NoSQL databases (MongoDB, Firebase, etc.) Understanding of web security best practices Familiarity with cloud platforms (AWS, Azure, Google Cloud) Experience with testing frameworks (Jest, Mocha, Jasmine, etc.) Projects or personal portfolio showcasing your full-stack development skills                                                                         ",
        "About UsCommon Room is the customer intelligence platform that captures every buying signal, giving companies superpowers with AI enrichment and automation to reach the right person with the right context at the right time.Despite an explosion of buyer signals, companies are left struggling with siloed point solution vendors, bloated tech stacks, and unactionable \"intent\" data. Common Room brings together all the buying signals you care about in one place so you can track the entire customer journey, match signals to real people and accounts, take action and automate.We’ve raised over $50 million from top-tier investors including Greylock, Index, and Madrona to build the world's first customer intelligence platform for modern B2B companies. And we’re backed by 25+ operators from the fastest-growing companies in the world such as Figma, Stripe, Airtable, Slack, Notion, Loom, and more.You + Common Room? You’d be joining a team that revels in asking hard questions, collaborating gladly, and making decisions quickly—a team that values simplicity, passion, trust, each other, and our customers above all.So hello! Please, knock on our door. We'd love to meet you.Why We Need YouYour focus on user-facing experiences, and ability to collaborate with engineers, PMs and designers, are your superpower. You have experience with React/CSS/HTML/TypeScript, and can rapidly convert design mocks into functional code. You build delightful, pixel-perfect user experiences which are snappy, and sweat the details on performance. You build maintainable, well-componentized code that other engineers can work with.Outside of this, you also identify and participate in important company-building initiatives that a fast growing startup needs.You would enjoy being a member of our team if you:Have 2+ years of experienceYou operate independently, but don’t hesitate to seek help and support from those around you to get your job done.Revel in your craft, are excited by and capable of owning large projects primarily in the front-end domainCollaborate effectively with other experienced engineers, designers and PMsAre capable of making high quality technical and non-technical tradeoffsPrefer well supported, stable technologies over trendy/fashionable tech, even in the fast-moving world of front-end frameworksYou sweat the details on matching designed product specs, and think of performance, componentization, and testability as core requirements of building a great front-end experience for customersBring your authentic self to work, and engage in candid + respectful feedbackBuild sustainably, and are capable of managing your time and priorities as best suits your needsEnjoy the journey as much as the destination, but never lose sight of the destinationDemonstrate pride, ownership, and accountability for your work, and expect the same from those you work withOur Current Tech StackWe choose tools that help solve the problem at hand efficiently. For our current set of problems, we prefer to primarily use TypeScript with Node.js. We use TypeGraphQL for our API endpoints, Apollo/Express as our web server, and Postgres (hosted on RDS) as our database. We use React for front-end, and AWS for our infrastructure needs.Our ValuesBe Customer-centric - We work backwards from the needs of our customers. The crisp articulation of customer value guides our decisions.Strive for Simplicity - We choose simplicity over complexity whenever possible. We seek to identify and understand the essential quality of what we are building.Make it Happen - We are quick to take the first step, and prioritize decisiveness over fear of making a mistake. We don’t confuse motion for movement and we measure ourselves on impact over actions.We’re In this Together - We measure personal success by the success of our customers and teammates. Relationships matter, and the strongest ones are built on the foundations of trust, enablement, and transparency.Our BenefitsOur investment in caring for our employees and their families is a key part of our values and culture at Common Room:Competitive base compensation with meaningful equity ownershipHealth insurance including medical, dental, and vision, HSA and FSAWe pay 100% of your employee premium and 50% of your premium for any dependentsUnlimited Paid Time OffPaid Company HolidaysWork from home policy including a laptop and support for your home office needsMonthly Remote Stipend401(k) self contributionPaid Family LeaveOpportunity to join a diverse, passionate, and fun team at a pivotal time in the company’s lifecycleCommon Room provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.                                                                                 ",
        "Can you help us build out a digital private practice for medical professionals that powers high quality care while handling complex payments and insurance billing behind the scenes?Our platform is already supporting a thriving business, but we need help keeping up with the rapid pace of growth and building features that will drive better care for some of the most common chronic conditions in the U.S.We're looking for a generalist full stack engineer who thrives in an early-stage startup environment and is willing to learn whatever it takes to get the job done.What You'll be Doing:Coding: You'll be focused on building — writing code up and down the stackDiscovering: As a small team, we don't have all of the knowhow for what we're going to build (e.g., how to put a hold on a credit card) and need someone who's unafraid to figure it outSleuthing: We need a clever code detective to root cause and fix the range of issues that arise in real-world software systemsIdea-surfacing: You'll be close to the code and will have good ideas for what we should be focusing our engineering efforts on — we want you to be speak up!Standard-setting: As an early employee and engineer at Fay, you'll be helping establish team culture and engineering standardsThe best companies are made of the best people. There's no shortage of work ahead, but we stay balanced and look forward to celebrating our wins as a team.                                                                                 ",
        "DescriptionJOB SUMMARY The Software Engineer I will participate in the development, implementation and maintenance of Python based applications. They will work closely with senior developers and contribute to the design, coding, testing and deployment processes. The role expects the person to be able to pair with other developers from time to time, understand project requirements and come up with efficient solutions, participate in code reviews. The Implementation Team is dynamic and looking for somebody who is strong in the present and is willing to learn and explore new modalities to accomplish our tasks.Essential Duties & ResponsibilitiesWrite feature code that fulfills requirements, compiles, passes test, and integrates successfully with larger software systems. Participate actively in paired programming. Begin to learn and demonstrate basic software craftsmanship techniquesUnderstand basic software testing strategy benefits and concepts. Develop appropriate unit and integration tests prior to completing feature work. Organize code so that it is unit-testableParticipate in team activities like standups and code reviews in order to promote proper communication about work product and issuesParticipate in monitoring and troubleshooting activities, including night rotations and on-call schedules QualificationsKNOWLEDGE & REQUIREMENTS Strong, proven understanding of Python programming language and its ecosystem.Experience in AWS ecosystem. Airflow experience is a plus.Knowledge of front end technologies like HTML, CSS, and JavaScript is a plusExcellent problem solving and analytical skillsAbility to work collaboratively in a team environmentStrong communication and interpersonal skillsGood time management and multitasking abilitiesUnderstand basic software testing strategy benefits and concepts. Develop appropriate unit and integration tests prior to completing feature work. Organize code so that it is unit testable Education & Experience RequirementsMinimum of one year relevant work experienceMinimum of Bachelors degree or equivalent work experience Physical RequirementsThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.Frequent sitting in stationary position at a deskOccasional standing, walking, stooping, kneeling, squatting, and climbing stairsOccasional twisting of bodyOccasional reaching by extending hands and arms in any directionOccasional lifting, pulling, or pushing                                                                         ",
        "No Recruiters Please.Must be in office 5 days / week.QualificationsBS degree in Computer Science or relevant field of study.Must have developed front end applications using Reactjs, Nodejs etc.Must have developed data applications using Python, Go.Must have working knowledge of any one of the Cloud Services (AWS, Google Cloud, Microsoft Azure, etc).Must have working knowledge of SQL and NoSQL, such as MySQL, PostgreSQL, Elasticsearch Clickhouse, Redis, Neo4j, etc.BonusKnowledge of Data Engineering tools and technologiesKnowledge of workflow orchestration management engines such as Airflow, Dagster, DBT, etcKnowledge of AI and ML technologiesKnowledge of Big Data technologies (e.g., Hadoop, Hive, Spark , Kafka ) and data engineering.Basic knowledge of distirbuted processing systems like Kafka or Apache Flink or Apache SparkAbout UsUsage AI (usage.ai), a platform that empowers companies to reduce costs by autonomously adjusting AWS, Azure, and GCP discount commitments to match changing infrastructure demands.                                                                                 ",
        "At First Advantage, people are at the heart of everything we do. This mindset spans from our customers and partners, to our greatest strength: our team members. Join us if you want to say “hello” to a rewarding career, and pave the way as an industry leader in mission-critical background screening solutions to some of the most recognized Fortune 100 and Global 500 brands.Who We AreWe are on the frontline of the Great Onboarding, empowering organizations to Hire Smarter. Onboard Faster™. First Advantage (Nasdaq: FA) is an HR Tech company that delivers innovative solutions and insights to enable our clients to manage risk and hire the best talent. Leveraging an advanced global technology platform, First Advantage builds fully scalable, configurable screening programs that meet the unique needs of over 33,000 clients across the world. Headquartered in Atlanta, GA and with a globally distributed workforce spanning 28 locations with 5,500+ employees, First Advantage performs over 93 million screens in over 200 countries and territories annually.Who You AreWe are looking for a team member who considers themselves:Self-motivated – you love to lead others but are also ready to “roll up your sleeves.\" You can spearhead a project and see it through from start to completion. A team player – you navigate cross-functional teams and work well with team members across groups toward a common goal. While you are an independent contributor, you appreciate the value in collaboration. An innovator – you see gaps in current processes or workflows as an opportunity to improve and try something new. A lifelong learner – you seek opportunities to learn and upskill, you understand the importance of thorough and secure screenings, and are interested in the Human Capital sector and the confluence of people, process, and technology. What You'll Do The Junior Software Engineer is responsible for adding new functionality to First Advantage's key products and solutions. Working on these high-volume, security intensive applications, the Jr Software Engineer is an entry-level role which develops quality code at differing levels of the stack. This individual will use their strong communication skills to work cross-functionally with global teams, and has the ability to actively and effectively understand client and team needs.This person will:Develop software applications and solutions based on documented business and system requirementsWrite, edit, and debug code for assigned projectsUnderstand how applicants operate, are structured, and how to use themProvide assistance to the testing team and support people as needed to resolve application issuesRespond promptly and professionally to bug reportsProvide input and estimates about the efforts required to build desired functionalityLearn and implement new technologies and design patternsUse Test-Driven Development (TDD) techniques to specify a detailed, executable design for your solutionWhat you’ll need to be successful:Bachelor's Degree in Computer Science or related field or equivalent1+ years of application development experience in one or more of the following:Backend Java or C#Frontend Angular 4+ or ReactDesire to learn all layers of the stack from front-end UI to databases and model layersThis is a fully remote position (Work from Home) based in the US.Why First Advantage is Your Next Big Career Move First Advantage is going through a technology transformation! We are looking for experts who are excited to work with advanced technologies and provide best-in-class user experiences, drive the development and deployment of scalable solutions, and smoothly guide our agile teams and clients through meaningful changes as we continue to expand our impact.Additional benefits offered to our eligible people include: Ability to work remotely with occasional business travel Medical, Vision, Dental, and supplementary benefit plans 401k with an employer match, and an Employee Stock Purchase Plan (ESPP) Competitive and flexible Paid Time Off (PTO) and 8 paid company holidays Access to tech and growth opportunities, and leaders who want you to succeed! More About Our Values Code Honor Honesty, Consistency, Responsibility: Do the right thing Cultivate an environment of dignity: Show respect for the individual Take an Outside-In approach: Put the client first Think out-of-the-box: Innovate and create Stay Team-Oriented: Collaborate and appreciate each other What Are You Waiting For? Apply Today! You have learned a little about us today – we want to learn about you! If you think this position and our company are a great fit for your areas of interest and expertise, tell us about you by applying now!United States Equal Opportunity Employment:First Advantage is proud to be a global leader in removing barriers and supporting our community members to ensure the changing demographics of the workforce are reflected in our hiring and employment practices. We value all of our candidates, employees, and clients, and place great emphasis on hiring and supporting qualified individuals in each role. We are an equal opportunity employer. We do not discriminate on the basis of race, color, ethnicity, ancestry, religion, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, genetic information, or any other area protected by applicable law.Powered by JazzHRG3X4Hf4pBs                                                                                 ",
        "OverviewWe are seeking a full-time Software Engineer 1 in our Yarmouth, ME location. In this role, you will be responsible for building upon existing software solutions to develop basic software for Garmin products and/or applications.Essential FunctionsPerforms new product and/or application software design and development as well as maintenance activities for products and/or applications already in production using C, C++, C#, Java, assembly language, or other selected languagesTroubleshoots basic issue reports, reproduces issues, evaluates technical cause and implements and tests software solutionsIdentifies and resolves defects of basic scope using proper engineering tools and techniques such as debuggers, emulators, simulators, and logic analyzersApplies design standards and procedures using appropriate engineering tools to document and implement basic designs in an organized mannerSupports working hours as part of a rotating schedule to provide on call support of Garmin’s 24/7 operationsBasic QualificationsBachelor’s Degree in Computer Science, Electrical Engineering, Computer Engineering, Software Engineering, Aerospace Engineering, Math, Physics or related field OR an equivalent combination of education and experienceExcellent academics (cumulative GPA greater than or equal to 3.0 as a general rule)Demonstrated knowledge, education, experience and/or training necessary to develop basic software in C, C++, C#, Java, assembly language, or other selected languagesDesired QualificationsOutstanding academics (cumulative GPA greater than or equal to 3.5)Previous work or internship experience in design, particularly for consumer productsGarmin International is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, citizenship, sex, sexual orientation, gender identity, veteran’s status, age or disability.This position is eligible for Garmin's benefit program. Details can be found here: Garmin Benefits                                                                         ",
        "About This TeamSuper.com engineering has three full-stack product development focus areas: travel, fintech, and a superapp that unifies travel and fintech along with several other savings and earnings use cases. Our dozens of microservices and event-driven architecture handle thousands of requests and events per second, ingest over 1TB of data per day and process over $1MM per day in sales, while maintaining a 99.9+% uptime. We have 80 engineers across our teams and our biggest selling point is our focus on supporting our engineers’ career growth, whether that’s as a technical contributor or people leader. As an engineer in our product development org you will work closely with Product Managers, Designers, and QA, and work in an agile, fast-paced environment (that respects work/life balance).About This RoleAs a full-stack engineer you will be a key technical contributor on our teams. You will tackle technical challenges the team faces spanning both frontend and backend web development work. This will include building features for our fintech, travel,, and/or superapp products along with the engines and frameworks that power them. You will predominantly work with React on the frontend, and a combination of Python and Node microservices on the backend. Other technologies you’ll work with include Gitlab, AWS, Postgres, Redis, Datadog, Amplitude, and Snowflake. You will report into an Engineering Manager. From a Software Engineer you may grow on the IC track into a Senior Software Engineer, and from there into a Staff Software Engineer or Engineering Manager.Key ChallengesShip projects end-to-end in a fast-paced, iterative environmentHave the opportunity to very meaningfully propel the business forward, and experience the impact of your work on the company’s business metrics and user experienceOwn features, services, caches, and databases, including: deployment, monitoring, debugging, and testingParticipate in cross-functional team projects, work with external stakeholders, and help shape the roadmap for future team projectsBe data-driven and close to the customer, conducting experiments for nearly everything you launchAbout YouWe’re looking for highly-motivated self starters who share our excitement for growth and impactWilling and able to work with both backend and frontend parts of the stack, though the proportion of time spent doing each will be influenced by the candidate’s interestsInterested in building products in a startup environment: moving quickly, being data-driven, wearing multiple hats, continuously learningStrong communicator, and able to thrive on an agile team, contributing to: standups, sprint ceremonies, and quarterly project planning, and working with various internal and external stakeholdersHighly motivated, have a strong sense of ownership, and are able to drive projects end-to-end3+ years professional working experience in software development, including 1+ years of Python or Node on the backend, and 2+ years working with a modern frontend JS framework (ex. React, Vue, Angular)Experience working with web services / modern web technologiesBonus PointsWorking experience across a breadth of our infrastructure, languages and stacks (React, Python, Node, Gitlab, AWS, Docker, Postgres, Redis, Datadog, Amplitude, and Snowflake)SQL / analytics know-how, and experienced with devops conceptsExperience in a startup environmentWorked closely with business stakeholdersExperience writing end-to-end/browser based testsWe've got you covered!Competitive salary packages, equity options, great benefits from day one, wellness budgets, as well as personal and team-level development budgets We are remote first – you have the flexibility to work from around the world and the hours that make sense for you– so that you can do your best work while living life on your own terms Other perks include: unlimited PTO, recharge days, travel discounts on SuperTravel, Weekly UberEats creditWe welcome new family additions with generous parental leave and a flexible return-to-work planThis is just scratching the surface – check out our careers site for a more detailed overview of our perks & benefitsAs part of our compensation philosophy at Super.com we benchmark roles based on geographic location. The base salary range for this position is $90,000 USD - $150,000 USD.                                                                                 ",
        "Seniority Level: Mid-levelAbout The Role And About YouAre you a talented and motivated Full Stack Software Engineer looking to make a significant impact? Do you thrive in a dynamic environment where your contributions drive value and innovation? If so, we want you on our team at Zwift!As a key player on our software development team, you will be primarily responsible for developing and maintaining our internal subscription platform, our e-commerce platform, and our web framework and CMS. These systems are crucial in ensuring that customers can easily discover Zwift, purchase hardware and subscriptions to get in the game, and manage their subscription long-term. You'll be part of a world class engineering team with a clear focus on supporting Zwift's revenue streams and playing a key role in the success of the business.Success in this role involves consistently delivering high-quality, maintainable code and meeting project deadlines. The ideal candidate will effectively collaborate with cross-functional teams, proactively solve complex technical challenges, and continuously seek opportunities for improvement. Additionally, they will contribute to customer satisfaction, take full ownership of your work, bring innovative ideas, and foster positive team dynamics. If you’re ready to take your career to the next level, apply today!What You’ll DoDevelop and maintain web and backend applications written in JavaScript and Java.Participate on on-call support, monitoring and troubleshooting of all services owned by the team.Collaborate with product managers, designers, and other engineers to gather requirements and translate them into technical specifications.Write clean, efficient, and scalable code for both front-end and back-end components.Conduct code reviews, perform debugging, and ensure code quality through unit testing and integration testing.Participate in agile development processes, including sprint planning, daily stand-ups, and retrospectives.What We’re Looking ForBachelor’s degree in Computer Science, Software Engineering, or a related field.3+ years of experience in full stack web development.Proficiency in front-end technologies such as HTML, CSS, JavaScript, and modern frameworks like React, Angular, or Vue.js.Strong back-end development skills with experience in languages such as Node.js, Python, Java, or Ruby.Experience with database technologies such as SQL, NoSQL, and ORM frameworks.Familiarity with RESTful API design and development.Experience with containerization and orchestration tools like Docker and Kubernetes.Knowledge of CI/CD pipelines and automated testing frameworks.Familiarity with microservices architecture.Strong problem-solving skills and attention to detail.Excellent communication and teamwork abilities.Bonus PointsExperience with one or more of the following:ShopifyNetsuiteC++ programmingMobile developmentReact Native developmentThe base salary for this position ranges between $ 71,000 to $135,000. The base salary will be based on a number of factors including the role offered, the individual's job-related knowledge, skills, qualifications, and geographic location. In addition to base salary, Zwift is proud to offer a comprehensive and competitive benefits package for all eligible employees which also includes performance bonuses, equity, and a full range of medical, financial, and other perks and benefits.How To Stand Out Among The RestYour resume/CV is enough to show off your skills, accomplishments, and experience. However, if you choose to include a cover letter introducing us to your awesome personality, we will read that too.We strongly believe that different backgrounds and ideas are a competitive advantage; we hire candidates of any race, color, ancestry, religion, sex, national origin, sexual orientation, gender identity, age, marital or family status, disability, Veteran status, and any other status. Zwift is proud to be an Equal Opportunity Employer. If you have a disability or special need that requires accommodation, please let us know by emailing careers@zwift.com.Zwift, Inc. is an Equal Opportunity Employer.                                                                         ",
        "DescriptionAt Amazon, we're working to create the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven leaders to help us deliver a great customer experience. We are looking for a dynamic, customer-obsessed and innovative SDE to join our Amazon Private Brands team. Our Private Brands offer customers outstanding quality, at great prices and we are looking for a SDE to deliver systems that will help customers discover our Private Brands products.Are you looking for a Software Development Engineer position building systems that drive Amazon’s website experience for millions of customers, across a catalog of billions of products?An information-rich and accurate product catalog is a strategic asset for Amazon and we use a wide-array of approaches to keep improving the customer experience. This role will partner with core catalog team to enhance existing meta-data platform capabilities that will allow managing brand level knowledge within the catalog systems. The platform will be the single source of truth for catalog data, cross marketplace mappings and validations with deep integration with listing tools, ASIN localization and post ASIN setup quality auditing platform.As a Software Development Engineer on the team you will take ownership over the software design, documentation, development, engineering approach, delivery and support of systems built natively in AWS. In this role you will collaborate with leaders, work backwards from customers, identify problems, propose innovative solutions, relentlessly raise standards, and have a positive impact on hundreds of millions of customersWe are open to hiring candidates to work out of one of the following locations:Seattle, WA, USABasic Qualifications 1+ years of non-internship professional software development experience Experience programming with at least one software programming languagePreferred Qualifications Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $99,500/year in our lowest geographic market up to $200,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.Company - Amazon.com Services LLCJob ID: A2652422                                                                                 ",
        "Summary Of PositionThe STARZ Data Products & Engineering team is seeking a software engineer who’s passionate about drawing a thin line from data to insight and exposing that insight to internal users to support important business decisions. We’re building out a robust and consistent data acquisition system with a growing portfolio of sources and sinks which enable other teams to analyze, view and report on the data. You’ll be helping internal users gain insight into what audiences to target for marketing, how original and licensed content is likely to perform in the Starz ecosystem and beyond and helping us to integrate disparate signals into a clear picture of where the organization is at and where we can go.Our users range from extremely technical (providing us with models to run and wanting tables or files in return) to less technical (providing inputs via a UI or spreadsheet and expecting results displayed in-line or in a report). This is an opportunity to exercise your technical skills as part of a highly skilled team from a variety of diverse backgrounds while helping every aspect of our business to be more efficient and more data driven.Full-time remote candidates will be considered.ResponsibilitiesDevelop, test, and maintain optimal data processing pipelines and related architectures, ensuring the overall solution will support business requirementsBuild the infrastructure required for optimal extraction, transformation and loading of data from a wide variety of data sources using AWS cloud-native technologies and .NETAssemble large, complex data sets that meet functional/non-functional business requirementsDevelop and implement processes for data acquisition, modeling, mining, and productionContinue to build out our data processing framework, and expand it to support less and less technical usersEmploy a variety of languages, tools, and techniques to marry systems and the data generated from those systems together to maximize the strategic value of the dataBuild analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, retention, behavior, and other key business performance metricsCreate data tools for analytics and data scientist team members that assist them in building and optimizing our productsRecommend and implement ways to improve/ensure data reliability, efficiency, and qualityIdentify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.Discover opportunities for new data acquisition and applicationBe prepared to translate findings to key stakeholdersWork in a heavily collaborative environment, taking on a variety of roles when necessary, with a positive and self-starting attitudeRequired SkillsLanguages: C#, SQLDatabase Systems: Snowflake or other Cloud-based Data Warehouse systemsExperience with third party data APIs (REST, GraphQL, etc)Cloud: AWS (EC2/ECS/S3/CDK), DockerFull lifecycle software developmentQualifications4+ years working directly as a member of a technical team, preferably developing/supporting/innovating for a consumer-facing analytics productStrong experience working with relational databases and consuming RESTful APIsSelf-starter with strong communication and team building skillsBS degree or equivalent experience in information management, computer science, math, statistics, or equivalent technical fieldNice to HavesDynamoDB, BigQuery, RedShiftAWS Lambda/Step FunctionsData warehousing and high-volume data processingAbout STARZSTARZ, a Lionsgate company, is a leading media streaming platform committed to delivering premium content that amplifies narratives by, about and for women and underrepresented audiences. STARZ is home to the highly rated and first-of-its-kind STARZ app that offers the ability to stream or download STARZ premium content, as well as the flagship domestic STARZ® service, including STARZ ENCORE, 17 premium pay TV channels, and the associated on-demand and online services. STARZ is available across digital OTT platforms and multichannel video distributors, including cable operators, satellite television providers, and telecommunications companies. In February 2021, STARZ launched #TakeTheLead, a multi-faceted and innovative inclusion initiative expanding its existing efforts to improve representation on screen, behind the camera and throughout the company.Our BenefitsFull Coverage – Medical, Vision, and DentalAnnual discretionary bonus and merit increaseWork/Life Balance – generous sick days, vacation days, holidays, and Impact Day401(k) company matchingTuition Reimbursement (up to graduate degree)Compensation$95,400 - $149,300EEO StatementLionsgate is an equal employment opportunity employer. All employees and applicants are evaluated on the basis of their qualifications, consistent with applicable state and federal laws. In addition, Lionsgate will provide reasonable accommodations for qualified individuals with disabilities. Lionsgate will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of applicable state and federal law. Employment Type: Full TimeSalary: $95,400 - $149,300 AnnualBonus/Commission: No                                                                         ",
        "This is a remote position.Junior Full Stack Web Developer - Remote Job, 1+ Year ExperienceAnnual Income: $59K - $75KA valid work permit is necessary in the USAbout us: Patterned Learning is a platform that aims to help developers code faster and more efficiently. It offers features such as collaborative coding, real-time multiplayer editing, and the ability to build, test, and deploy directly from the browser. The platform also provides tightly integrated code generation, editing, and output capabilities.Description:This position is ideal for individuals who are passionate about both front-end and back-end development and want to gain valuable experience in a supportive and collaborative environment.Responsibilities:Collaborate with the development team to design, develop, and maintain web applications Implement responsive and user-friendly front-end designs using HTML, CSS, and JavaScript Develop server-side code and APIs using programming languages such as Python, Ruby, or Node.js Design and maintain databases and perform database queries for data retrieval and manipulation Write clean, modular, and efficient code for both front-end and back-end components Participate in code reviews and provide constructive feedback Troubleshoot and debug issues to ensure optimal performance and user experience Stay up-to-date with emerging web technologies and industry trends Contribute to improving the overall web development process Requirements:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience) Strong knowledge of HTML5, CSS3, and JavaScript Experience with front-end frameworks (such as React, Angular, or Vue.js) Proficiency in at least one server-side programming language (Python, Ruby, Node.js, etc.) Familiarity with databases and SQL Understanding of RESTful APIs and web services Experience with version control systems (e.g., Git) Good problem-solving and analytical skills Excellent communication and teamwork abilities Preferred Qualifications:Familiarity with back-end frameworks (such as Django, Ruby on Rails, Express, etc.) Knowledge of NoSQL databases (MongoDB, Firebase, etc.) Understanding of web security best practices Familiarity with cloud platforms (AWS, Azure, Google Cloud) Experience with testing frameworks (Jest, Mocha, Jasmine, etc.) Projects or personal portfolio showcasing your full-stack development skills Why Patterned Learning LLC?Patterned Learning can provide intelligent suggestions, automate repetitive tasks, and assist developers in writing code more effectively. This can help reduce coding errors, improve productivity, and accelerate the development process.Pattern recognition is particularly relevant in the context of coding. Neural networks, especially deep learning models, are commonly employed for pattern detection and classification tasks. These models simulate human decision-making and can identify patterns in data, making them well-suited for tasks like code analysis and generation.                                                                         ",
        "DescriptionAt Amazon, we're working to create the most customer-centric company on earth. To get there, we need exceptionally talented, bright, and driven leaders to help us deliver a great customer experience. We are looking for a dynamic, customer-obsessed and innovative SDE to join our Amazon Private Brands team. Our Private Brands offer customers outstanding quality, at great prices and we are looking for a SDE to deliver systems that will help customers discover our Private Brands products.Are you looking for a Software Development Engineer position building systems that drive Amazon’s website experience for millions of customers, across a catalog of billions of products?An information-rich and accurate product catalog is a strategic asset for Amazon and we use a wide-array of approaches to keep improving the customer experience. This role will partner with core catalog team to enhance existing meta-data platform capabilities that will allow managing brand level knowledge within the catalog systems. The platform will be the single source of truth for catalog data, cross marketplace mappings and validations with deep integration with listing tools, ASIN localization and post ASIN setup quality auditing platform.As a Software Development Engineer on the team you will take ownership over the software design, documentation, development, engineering approach, delivery and support of systems built natively in AWS. In this role you will collaborate with leaders, work backwards from customers, identify problems, propose innovative solutions, relentlessly raise standards, and have a positive impact on hundreds of millions of customersWe are open to hiring candidates to work out of one of the following locations:Seattle, WA, USABasic Qualifications 1+ years of non-internship professional software development experience Experience programming with at least one software programming languagePreferred Qualifications Bachelor's degree in computer science or equivalentAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.Our compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $99,500/year in our lowest geographic market up to $200,000/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information, please visit https://www.aboutamazon.com/workplace/employee-benefits. This position will remain posted until filled. Applicants should apply via our internal or external career site.Company - Amazon.com Services LLCJob ID: A2653293                                                                                 ",
        "Job Title: Software Engineer 0About Us:InterImage is a dynamic and innovative tech company dedicated to creating cutting-edge software solutions. We thrive on pushing boundaries, solving complex challenges, and fostering an environment of creativity and collaboration.The Software Engineer develops, maintains, and enhances complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements. Works individually or as part of a team. Reviews and tests software components for adherence to the design requirements and documents test results. Resolves software problem reports. Utilizes software development and software design methodologies appropriate to the development environment. Provides specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial Off-the-shelf (COTS)/Government Off-the-shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components. No demonstrated experience is required. Bachelors degree in Computer Science or related discipline from an accredited college or university is required; Four (4) years of SWE experience on projects with similar software processes may be substituted for a bachelors degree.Paid Time Off: 4 weeks.Paid Holiday Leave: 11 days (88 Hours).Life Insurance: $50,000; 100% of premium.Short-term/Long-term Insurance: 100% premium.Healthcare: 2 CareFirst Administrator plans offered, $0 Employee only option, Metlife for Vision, and The Standard for Dental.                                                                         ",
        "Take your career to a new level and work at an extraordinary company in Littleton COAt the dawn of a new space age, Lockheed Martin is a pioneer, partner, innovator and builder. Our amazing employees are on a mission to make a difference in the world and every single day we use our unique skills, talents and experiences to design and build solutions to some of the world’s hardest engineering problems.Come be part of a culture that inspires employees to think big, perform with excellence and build incredible products! We provide the resources, inspiration and focus. If you have the passion and courage to dream big, then we want to build a better tomorrow with you!For over 60 years, the Fleet Ballistic Missile (FBM) team has supported the Navy’s mission to provide affordable and credible strategic defense. We offer unique career opportunities and challenges on a program with a rich history and exciting future. We help keep this nation and our allies secure. The FBM Program is experiencing significant growth and we need your expertise to deliver amazing new technologies to our customers while maintaining the technical requirements of the strategic deterrence.What does this role look like?For this role, you will be joining the Fleet Ballistic Missile (FBM) Avionics organization committed to developing flight software for the missile system. They will join a team of Guidance Navigation and Control (GNC) and software engineers that designs and develops mission critical GNC subsystems for the FBM program. The duties for the position will incorporate all phases of the software development life cycle -- requirements, design, code, test, and maintenance.Typical Mins For This Role 2 - 5 years of professional experience for this role. You will need to obtain and maintain a Secret clearance, thus US Citizenship is required.Join us. Let’s do Space!Benefits Of EmploymentLearn more about Lockheed Martin’s comprehensive benefits package.We are an equal opportunity employer and value diversity at Lockheed Martin. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.                                                                                 ",
        "Netflix is the world's leading streaming entertainment service, with over 230 million paid memberships in over 190 countries, enjoying TV series, documentaries, and feature films across various genres and languages. Members can watch or play as much as they want, anytime, anywhere, on any internet-connected screen.Machine Learning/Artificial Intelligence powers numerous aspects of the Consumer Experience, including innovation in content discovery and personalization for members, identifying and attracting new members to our product, optimizing our payment processing, and many more.The OpportunityThe Consumer ML Model Compute & Serving Systems team provides the foundation for model computation, inference, and serving for all ML/AI innovation across the various Consumer ML domains. The team is responsible for developing all the building blocks required to run ML models at scale. These building blocks include a model serving platform, an event-driven model compute framework, a compute orchestration engine, and many more.We are looking for strong software engineers for this team, which is a central focus of our business. You will play a highly cross-functional role, partnering with other engineers, product management, machine learning, and data teams to take Netflix’s ML/AI initiatives to the next level.If you have a passion for building scalable, robust systems, are interested in pushing the envelope in applying ML algorithms, and operate in a critical part of the stack that strongly influences what our customers see on their screens, then we want to talk to you.You May Enjoy Working With Us IfYou strive to embrace best practices and are curious about discovering new and better ways to solve problems.You are self-driven and highly motivated to deliver top-tier solutions while learning from and collaborating with Stunning Colleagues.You are strongly motivated to pick up new domains and ship high-quality, well-tested code.You are excited to work in a multidisciplinary environment (engineering, algorithms, data engineering/science, product experimentation).You are comfortable working in a majority-remote team with partners distributed across (US) geographies & time zones.We Would Love To Work With You IfYou have experience building high-traffic distributed systems and ML infrastructure. You have experience supporting large-scale ML models with a direct impact on the customer experience with high availability, throughput, and performance.You are adept at building applications in an object-oriented programming language. We work with Java primarily, so an interest in learning and coding in Java is required.You have strong DevOps experience including performance tuning and optimizations, managing deployments, and capacity planning for large applications.You are experienced working with the public cloud like AWS, Azure, or GCP.You are a proactive, effective communicator and have a strong bias towards action.You have a BS/MS in Computer Science, Applied Math, Engineering, or a related field.Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $100,000 - $464,000.Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.Netflix is a unique culture and environment. Learn more here.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity of thought and background builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.                                                                                 ",
        "This is a remote position.Junior Software Development Engineer - Remote Job, 1+ Year ExperienceAnnual Income: $60K - $75KA valid work permit is necessary in the USAbout us: Patterned Learning is a platform that aims to help developers code faster and more efficiently. It offers features such as collaborative coding, real-time multiplayer editing, and the ability to build, test, and deploy directly from the browser. The platform also provides tightly integrated code generation, editing, and output capabilities.Description:As a Junior Software Development Engineer, you will play a crucial role in the design, development, and maintenance of our software applications. You will work closely with senior engineers and collaborate with cross-functional teams to deliver high-quality solutions. This is an exciting opportunity to kick-start your career in software development and contribute to innovative projects in a supportive and collaborative environment.Responsibilities:Collaborate with the development team to understand project requirements and objectives Participate in the entire software development lifecycle, from design to deployment Write clean, efficient, and maintainable code following best practices and coding standards Contribute to the development of both front-end and back-end components Collaborate with designers to ensure a visually appealing and user-friendly interface Integrate APIs and web services to enable seamless communication between different systems Conduct testing and debugging to ensure the functionality and performance of applications Participate in code reviews and provide constructive feedback to improve code quality Stay up-to-date with the latest software development trends and technologies Document technical specifications and project details Qualifications:Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience) Solid understanding of software development principles and best practices Proficiency in at least one programming language (e.g., Java, C++, Python, Ruby) Familiarity with front-end development languages such as HTML, CSS, and JavaScript Knowledge of relational databases and SQL Understanding of version control systems (e.g., Git) Strong problem-solving and analytical skills Excellent communication and collaboration abilities Ability to work independently and within a team Eagerness to learn and adapt to new technologies Preferred Qualifications:Experience with software development projects (personal or professional) Familiarity with front-end frameworks/libraries like React, Angular, or Vue.js Knowledge of back-end frameworks (e.g., Spring, Django, Ruby on Rails) Exposure to cloud platforms such as AWS, Azure, or Google Cloud Understanding of Agile development methodologies Basic understanding of software testing principles and methodologies Benefits:Flexible vacation, unlimited paid holidays, and paid sick days 401(k) with up to 2% employer match Health, vision, and dental insurance Why Patterned Learning LLC?Patterned Learning can provide intelligent suggestions, automate repetitive tasks, and assist developers in writing code more effectively. This can help reduce coding errors, improve productivity, and accelerate the development process.Pattern recognition is particularly relevant in the context of coding. Neural networks, especially deep learning models, are commonly employed for pattern detection and classification tasks. These models simulate human decision-making and can identify patterns in data, making them well-suited for tasks like code analysis and generation.                                                                         ",
        "The coolest jobs on this planet… or any other…are with Lockheed Martin Space.At the dawn of a new space age, LockheedMartin is a pioneer, partner, innovator andbuilder. Our amazing men and women are on amission to make a difference in the world andevery day we use our unique skills andexperiences to create, design and build solutionsto some of the worlds’ hardest engineeringproblems. Our culture encourages employees todream big, perform with excellence and createincredible products. We provide the resources,inspiration and focus and if you have the passionand courage to dream big, we want to build a better tomorrow with you.Within LM Space, the Echo Program Area islooking for a highly motivated individual to jointhe program area as a Software Engineer. Thisexciting position will fill a critical need in the newand emerging area of protecting space assets. You will be working with a custom builtsoftware framework and its baseline whileintegrating into new industry standard anddevelopment pipeline tools. As part of an Agile team, you will have theopportunity to work on a variety of tasks invarious areas across the mission and collaboratewith the development teams, contractors,customers, and subject matter experts. As a member of the Sustainment team, youwill have the opportunity to maintain anoperational system while engaging withoperators and customer representatives onprioritizing issues.This position provides the opportunity to be apart of the entire engineering life-cycle, wherethe candidate will be able to apply their SoftwareEngineering background at the lowest level allthe way up through full system functionality.The Echo Program Area provides a variety ofdevelopment efforts and opportunities focusedon meeting customer driven and operationalneeds. If you are looking for a new position in afast-paced team environment, where every daybrings a new challenge, and you want to supporta critical space security mission, the EchoProgram Area is the place for you.This position requires an Active DOD SecurityClearance to begin employment, at a minimumlevel of: Top SecretWork will be performed within a SensitiveCompartmented Information Facility (SCIF) andwill require candidates submit informationnecessary to obtain special programs access, beeligible for, and receive final adjudication, foraccess to Sensitive Compartmented Information(SCI)                                                                                 ",
        "The Red Hat OpenShift Experiences UI team is looking for a front end developer to join the Managed OpenShift console offerings. In this role, you will develop UI components using React JS primarily to support the user experience vision of our interaction designers. You'll need to be both creative and self-motivated, proficient in building web applications, and able to work in a fast-paced, distributed environment. The primary area of expertise for this position is React JS and its associated frameworks (ie. TypeScript, Redux, REST API, CSS, JSX, HTML, etc).Red Hat OpenShift Cluster Manager is a managed service where you can install, modify, operate, and upgrade your Red Hat OpenShift clusters. This service allows you to work with all of your organization’s clusters from a single dashboard. Being part of the OpenShift Cluster Manager products is about passion for technology and development. You'll need to be creative and motivated, proficient in building web applications, and able to work in a fast-paced, distributed environment.What you will doImplement UIs with clean, responsive, and accessible Javascript, Typescript, HTML or CSS as needed to support the design visionWork with UX designers and researchers to bring UI designs from concept to implementation through rapid prototyping and evaluation of design ideasWork with the supporting development teams to gather information about system APIs and help shape the data that is available for UI consumptionConsider an end-to-end user experience that spans product onboarding, usage, and supportCollaborate with peer developers, designers, and product management during brainstorming sessions, design reviews, and code reviews.Work closely with designers during brainstorming, design reviews, and iteration of UI improvementsIterate with the team to improve your solutionsWhat you will bringCollaborative approach to front-end software development with experience building web applications using React JS, Redux, REST, and HTML/CSS.Experience with development tools like Git or WebpackGreat communication and collaboration skills, with a solid attention to detailWillingness to learn new technologies, languages, and systemsThe Following Are Considered a PlusExperience with development tools like TypeScript, Git, webpack, JUnit, and CypressExperience with agile development and open source projectsFamiliarity or interest with OpenShift, Kubernetes, or cloud platforms in generalFamiliarity with GolangThe salary range for this position is $72,080.00 - $115,290.00. Actual offer will be based on your qualifications.Pay TransparencyRed Hat determines compensation based on several factors including but not limited to job location, experience, applicable skills and training, external market value, and internal pay equity. Annual salary is one component of Red Hat’s compensation package. This position may also be eligible for bonus, commission, and/or equity. For positions with Remote-US locations, the actual salary range for the position may differ based on location but will be commensurate with job duties and relevant work experience.About Red HatRed Hat is the world’s leading provider of enterprise open source software solutions, using a community-powered approach to deliver high-performing Linux, cloud, container, and Kubernetes technologies. Spread across 40+ countries, our associates have the flexibility to choose the work environment that suits their needs from in-office to fully remote to office-flex. Red Hatters are encouraged to bring their best ideas, no matter their title or tenure. We're a leader in open source because of our open and inclusive environment. We hire creative, passionate people ready to contribute their ideas, help solve complex problems, and make an impact. Opportunities are open. Join us.BenefitsComprehensive medical, dental, and vision coverageFlexible Spending Account - healthcare and dependent careHealth Savings Account - high deductible medical planRetirement 401(k) with employer matchPaid time off and holidaysPaid parental leave plans for all new parentsLeave benefits including disability, paid family medical leave, and paid military leaveAdditional benefits including employee stock purchase plan, family planning reimbursement, tuition reimbursement, transportation expense account, employee assistance program, and more!Note: These benefits are only applicable to full time, permanent associates at Red Hat located in the United States.Diversity, Equity & Inclusion at Red HatRed Hat’s culture is built on the open source principles of transparency, collaboration, and inclusion, where the best ideas can come from anywhere and anyone. When this is realized, it empowers people from diverse backgrounds, perspectives, and experiences to come together to share ideas, challenge the status quo, and drive innovation. Our aspiration is that everyone experiences this culture with equal opportunity and access, and that all voices are not only heard but also celebrated. We hope you will join our celebration, and we welcome and encourage applicants from all the beautiful dimensions of diversity that compose our global village.Equal Opportunity Policy (EEO)Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.Red Hat supports individuals with disabilities and provides reasonable accommodations to job applicants. If you need assistance completing our online job application, email application-assistance@redhat.com. General inquiries, such as those regarding the status of a job application, will not receive a reply.                                                                         ",
        "Junior Software Engineer Surfside is an end-to-end marketing technology company that has built a first of its kind data activation and customer acquisition platform that provides brands and retailers the ability to manage, enrich and activate all of their customer data in order to increase awareness, traffic, and ultimately sales. We partner with many of the leading brands, retailers, and advertisers across Direct-to-Consumer Cannabis, Healthcare, and their adjacent industries. Our success is driving organic growth and we are looking for innovative, action-oriented professionals with the desire and initiative to make a major impact on the business. The work environment is collaborative, fast-paced and team-driven. Opportunities for growth are significant and immediate as the engineering team is expected to grow 100% in 2021 alone, with no sign of slowing down.  We are looking for a customer-focused engineer to join our team as a Junior Software Engineer. The ideal candidate is front end / javascript focused and has 1-3 years of experience in software engineering. This is an opportunity to build best in class e-commerce experiences for our customers, implement features that directly impact the business, and collaborate cross functionally with Product and Design.  What you will be responsible for:Building beautiful user interfaces that align with our Design SystemArchitecting, implementing, and maintaining React components within our component libraryShipping features that move the needle on key performance indicatorsCollaborating cross functionally with Product, Design, Data, and MarketingImplementing pixel and user tracking metricsOptimizing and improving our code baseWorking with 3rd party integrationsParticipating in code reviews What we’ll love about you:Agile and excited to work in collaborative and cross-functional team environmentYou care about the customer journey and fight for what is best for the customerYou have excellent analytical and problem-solving skills, and can communicate your ideas clearlyA team player who is willing and happy to helpStrong written and verbal communication skillsBelief in our mission and understand the importance of giving-backInquisitive, love to learn, embrace failure, and never give upComfortable working in an open office environment while staying focused What you’ll love about us:We are a team of smart, interesting, diverse, funny, and loving people.We offer competitive compensation, health, medical and dental benefits, snacks and a fun, relaxed office environment.We take the responsibility to make sure you are excited, happy, and find fulfillment in your work very seriously.We value fun, hosting office lunches, offsite team outings, and are currently planning our inaugural annual company retreat.We believe success comes from the collective effort of all, which is why all full-time employees receive equity in the business.We offer flexible paid time off for all full-time employees. This includes unlimited vacation, sick days, and wellness days because we understand the value of health, relaxation, spending time with friends and family, and traveling the world. About you:1-3 years of experience in software engineeringComfortable with modern web technologies including JavaScript, HTML5, CSS/SASSFamiliarity with Front End frameworks such as React, VueJS, AngularExperience integrating with backend servicesInterest in test driven developmentSome e-commerce experience (a plus)Surfside is an Equal Opportunity Employer and recognizes that a diverse workforce is crucial to our success as a business. We encourage and welcome you to apply irrespective of age, gender identity, race, religion, sexual orientation, color, pregnancy, family responsibilities, national and social origin, political opinion, marital, veteran, or disability status.                                                                         ",
        "About The JobDo you want to substantially impact the future of Hopper's travel technology? We're hiring a Senior Software Engineer to join our Fintech team and help us innovate the evolution of travel selling and booking technology. Fintech contributes to 50% of the company's overall revenue. As a Software Engineer, you will be directly responsible for crafting, implementing, and deploying the sophisticated backend systems that power Hopper’s award-winning user experience.We’re seeking an experienced Software Engineer to join our team to help us grow and mature the Flexibility fintech products. In this role, you’ll be working alongside a team of talented engineers and partner with product, design, and data science to prioritize, estimate, and implement new product features in an Agile environment.The ideal candidate is passionate about building high-quality software and takes ownership of their work. You should be adept at quickly delivering quality results and be able to differentiate between critical initial requirements and areas that can be iteratively improved. We'd love to hear from you if you thrive in a fast-paced environment and enjoy creative problem-solving.You will work as part of a cross-functional team of exceptional engineers, designers and product managers to bring new features to market and provide best in class support for our partners to scale our joint businessWhat Would Your Day-to-day Look LikePlanning, investigating, or scoping out an upcoming project that you own.Mentoring other team members, either through pair programming or asynchronously through Slack.Writing code, reviewing code, and improving code.Learning about a new technical concept, service, or GCP feature that provides value to our team.Collaborate cross-functionally with the product team and other Hopper teamsThoughtfully assist with the evolution and automation of our operational processesAn Ideal Candidate HasExperience in Scala or other JVM languages (such as Kotlin or Java), with demonstrated experience in a production setting.Experience in frontend technologies like AngularJs, ReactJS Good understanding of system architecture, focusing on designing scalable and maintainable solutions.Skilled in various service communication methods, including gRPC, pub/sub, and REST.Experienced in deploying infrastructure using Terraform or similar tools.Committed to enhancing system quality and reliability, showcasing excellence in software engineering practices.Professional background in the travel or fintech industries, with an understanding of their specific challenges and requirements.Perks Of Working With UsWell-funded and proven startup with large ambitions, competitive salary and the upsides of pre-IPO equity packagesUnlimited PTOCarrot Cash travel stipendFlexdesk All Access Pass AND Work-from-home stipendPlease ask us about our very generous parental leave, much above industry standards!Entrepreneurial culture where pushing limits and taking risks is everyday businessOpen communication with management and company leadershipSmall, dynamic teams = massive impact100% employer paid medical, dental, vision, disability and life insurance plansHealth Reimbursement Account (HRA)Access to a 401K plan#posttoexternalMore About HopperAt Hopper, we are on a mission to become the leading travel platform globally – powering Hopper’s mobile app, website and our B2B business, HTS (Hopper Technology Solutions). By leveraging massive amounts of data and advanced machine learning algorithms, Hopper combines its world-class travel agency offering with proprietary fintech products to bring transparency, flexibility and savings to travelers globally. We have developed several unique fintech solutions that address everything from pricing volatility to trip disruptions – helping people travel better and save more on their trips.The Hopper platform serves hundreds of millions of travelers globally and continues to capture market share around the world. Ranked the third largest online travel agency in North America, the Hopper app has been downloaded over 120 million times and has become largely popular among younger travelers – with 70% of its users being Gen Z and millennials.While everyone knows us as the Gen Z and Millennial travel app, Hopper has evolved to become much more than that. In recent years, we’ve grown into a global travel agency and travel fintech provider that powers some of the world’s largest brands.Through HTS, our B2B division, the company supercharges its partners’ direct channels by integrating our fintech products on their sites or powering end-to-end travel portals. Today, our partners include leading travel brands like Capital One, Nubank, Air Canada and many more.Here are just a few stats that demonstrate the company’s recent growth:Hopper sells billion worth of travel and travel fintech every year. In 2023, over 1.3 billion trips were planned through the Hopper app and our HTS partnerships.Our fintech products – including Price Freeze, Flexibility for Any Reason and Flight Disruption Assistance – have exceptionally strong CSAT because the terms are always clear, and customers receive instant, no-questions-asked resolutions.Almost 30% of our app customers purchase at least one fintech product when making a booking; and consumers are 1.6x more likely to repurchase if they add fintech to their booking vs if they booked just travel.Given the success of its fintech products, Hopper launched a B2B initiative, HTS (Hopper Technology Solutions), which represents more than 50% of the business.Through HTS, any travel provider (airlines, hotels, banks, travel agencies, etc.) can integrate and seamlessly distribute Hopper’s fintech or travel inventory on their direct channels. As its first HTS partnership, the company partnered with Capital One to co-develop Capital One Travel, a new travel portal designed specifically for cardholders. Other HTS partners include Air Canada, Uber, CommBank, Nubank, Flair Airlines with many more in the pipeline.Featured in Apple’s Best of the App Store list of Essential Travel Apps in 2023 and recognized by the likes of Fast Company’s Most Innovative Companies, Hopper has been downloaded over 120 million times and continues to have millions of new installs each month. Hopper is now the #3 largest online travel agency in North America and 70% of our app customers are Gen-Z and millennials travelers.Hopper has raised over $750 million USD of private capital and is backed by some of the largest institutional investors and banks in the world. Hopper is primed to continue its acceleration as the world’s fastest-growing mobile-first travel marketplace.Come take off with us!The yearly total compensation for this senior position ranges from 125 000$ to 270 000$ USD. Compensation will be determined by candidates' relevant qualifications, knowledge, skills and work experience. Total compensation will include a solid base salary and will also include equity (options / RSUs), sign-on bonus and other potential incentives.                                                                                 ",
        "Modern Animal is revolutionizing the veterinary industry. Our mission is to enhance the vet experience, improve the tools used by our veterinary doctors and nurses, and enrich the member experience through technology.As a Software Engineer at Modern Animal, you will contribute to the full-stack development of our cutting-edge software solutions. This role involves working on a full-stack platform to support our Members and our Veterinary team. You will play a key role in shaping the future of veterinary care by improving our internal tools and member experiences.This is a long-term, open-ended contractor position with no fixed end date. We value long-term relationships with our team members and aim to build a lasting partnership that supports Modern Animal's mission and growth. While the contract does not have a predetermined end date, it includes provisions for regular reviews and mutual agreement to ensure ongoing alignment and satisfaction on both sides.This role requires close collaboration with our teams based in the United States and Latin America. To foster effective teamwork and communication, we are looking for candidates who can work within a Pacific Time Zone (PT) schedule, plus or minus 2 hours.Key Responsibilities:Research, design, implement, manage, test, and evaluate software solutions for Modern Animal's web and mobile applications and backend services.Develop using React with TypeScript, React Native, and Python Django, aligning with Modern Animal's standards and best practices.Contribute to a collaborative environment, communicating effectively with team members and stakeholders.Actively learn and integrate new technologies, including GraphQL, Celery, and various AWS tools and services, to enhance our applications and services.Success Criteria:Deliver high-quality, functional, performant, and secure software solutions.Adherence to Modern Animal's chosen technologies and best practices.Achieve high satisfaction levels among Modern Animal team members and stakeholders.Demonstrated ability to effectively learn and apply new technologies.What We Offer:A flexible, remote work culture with a focus on asynchronous communication, supplemented by a few daily stand-ups and sync meetings each week.A supportive environment for professional growth and learning.Paid Time Off (PTO) policy of 15 days per year for contractors.The pay range for this position is $ $1,350 to $1,550 per week; however, base pay offered may vary depending on job-related knowledge, skills, and experience. A sign-on bonus and equity grant units may be provided as part of the compensation package, in addition to a full range of medical, financial, and/or other benefits, dependent on the position offered. This information is provided per the California Pay Transparency Act. Base pay information is based on geographic location.We believe an equitable and inclusive work environment and a diverse, empowered team are key to achieving our mission. We're not looking for candidates who are \"culture fits.\" We're looking for candidates who can expand our culture and challenge business as usual. We strive to foster an environment where all staff can bring their whole selves to work, by their own definition, and we strive to provide all candidates with an equitable and accessible recruitment process.We provide equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, sexual orientation, gender identity or expression, veteran status, or genetics.In addition to federal law requirements, we comply with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities.This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.If we can offer accommodations for you in the recruitment process, or if you have feedback on how to make our recruiting more equitable or accessible, please let us know!                                                                                 "
    ]
}